{"status": "OK", "copyright": "Copyright (c) 2013 The New York Times Company.  All Rights Reserved.", "response": {"docs": [{"print_page": null, "web_url": "http://www.legacy.com/Link.asp?I=LS000173120628", "snippet": "BALLAN--Lynn (Gartman), passed away on November 9, 2014 at the age of 77. She is survived by her husband Jerome; her daughters Beth Cohen and Stacy Kron; their spouses Douglas and Kurtis; her grandchildren and her brother Warren Gartman and his sp...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  BALLAN, LYNN "}, "word_count": "80", "keywords": [], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-10T19:14:33Z", "_id": "5461de2438f0d80b742a0217", "lead_paragraph": "<!-- LYNN BALLAN -->BALLAN--Lynn (Gartman), passed away on November 9, 2014 at the age of 77. She is survived by her husband Jerome; her daughters Beth Cohen and Stacy Kron; their spouses Douglas and Kurtis; her grandchildren and her brother Warren Gartman and his spouse Susan. Lynn was very much loved and will be terribly missed. A memorial service will be held on Sunday, November 16, at The Plaza Jewish Community Chapel, 630 Amsterdam Ave. at West 91st St. in Manhattan at 2pm.<br/><br/><br><br>\n ", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": null, "web_url": "http://www.legacy.com/Link.asp?I=LS000173120625", "snippet": "ALVY--Susan Weissman, 67, on November 10, 2014, after a courageous battle with cancer. Daughter of the late Evelyn and Louis Weissman. Mother of Rachel and Richard Relkin and Deborah and Scott Semaya. Grandmother of Sydney, Adam, and Sophie. Siste...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  ALVY, SUSAN "}, "word_count": "124", "keywords": [], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-10T19:14:31Z", "_id": "5461de2438f0d80b742a0216", "lead_paragraph": "<!-- SUSAN ALVU -->ALVY--Susan Weissman, 67, on November 10, 2014, after a courageous battle with cancer. Daughter of the late Evelyn and Louis Weissman. Mother of Rachel and Richard Relkin and Deborah and Scott Semaya. Grandmother of Sydney, Adam, and Sophie. Sister of David Weissman and sister-in-law to Andrea. Best friend and twin sister of Judy Weiss and sister-in-law to Barry. Nieces and nephews Steven and Stephanie, Jessica, Rebecca, Daniel and Becky, Elliot, and Julia. Susan was an accomplished tennis player and enjoyed twenty years as the manager of Rockville Racquet Club. Recipient, 2013 Lifetime Achievement Award USTA Eastern Long Island Region. Attended Camp Robindel, Lawrence High School and Ithaca College. Services on Wednesday, November 12, at 11am at \"Gutterman's\" 175 N. Long Beach Rd., Rockville Centre.<br/><br/><br><br>\n ", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": null, "web_url": "http://www.legacy.com/Link.asp?I=LS000173120624", "snippet": "TRAGER--Seymour. Beloved husband of the late Joan. Treasured father of Barbara Katz, Michael and the late Marlene Kevy. Devoted father-in-law of Cara and Larry. Cherished grandfather of Jonathan, Lauren, Jessica, Melissa, Eric, Alyssa, Rachel, Ben...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  TRAGER, SEYMOUR "}, "word_count": "53", "keywords": [], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-10T19:14:30Z", "_id": "5461de2738f0d80b742a0226", "lead_paragraph": "<!-- SEYMOUR TRAGER -->TRAGER--Seymour. Beloved husband of the late Joan. Treasured father of Barbara Katz, Michael and the late Marlene Kevy. Devoted father-in-law of Cara and Larry. Cherished grandfather of Jonathan, Lauren, Jessica, Melissa, Eric, Alyssa, Rachel, Ben and Matt. Best friend to Flo Feldman. Service Wednesday 10am, Sinai Chapel, 162-05 Horace Harding Expressway, Fresh Meadows.<br/><br/><br><br>\n ", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": null, "web_url": "http://www.legacy.com/Link.asp?I=LS000173120623", "snippet": "FOSTER--Israel Howard. We mourn the death of our husband and father, Israel Howard Foster, on November 2, shortly after his 91st birthday. Hal was the center of our universe as we were the constellation of his. Hal's sense of adventure and duty le...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  FOSTER, ISRAEL "}, "word_count": "240", "keywords": [], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-10T19:14:28Z", "_id": "5461de2638f0d80b742a021c", "lead_paragraph": "<!-- ISRAEL FOSTER -->FOSTER--Israel Howard.<br/><br/> We mourn the death of our husband and father, Israel Howard Foster, on November 2, shortly after his 91st birthday. Hal was the center of our universe as we were the constellation of his. Hal's sense of adventure and duty led him to many ports of call as a Pharmacist's Mate First Class in the Navy during WWII. He afterward owned and operated Foster's Pharmacy in Bedford Stuyvesant, where he was a fixture and beloved member of that community for over thirty years. Hal was a handsome man with beautiful, empathetic eyes and an uncomplicated joy in his life that endeared him to all who fell within the orbit of his gaze. He could do anything and do it well and we depended upon his quiet competence for the safety of our world. Hal's life was defined by his love for his family: Essie, his wife of almost 64 years, his five children Michael, Stacy, Tamar, Rafe, and Jody, and his eight grandchildren. This happiness was immutably altered in 2003 with the untimely death of his youngest son, Rafe, and again in 2012 with the death of his eldest son, Michael. This assault on his spirit took its toll on his already declining health and Hal spent the last four and a half years lovingly tended in the home of his daughter Tamar. Our dearest Hal, we love you so much, your spirit will be with us always.<br><br>\n ", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": null, "web_url": "http://www.legacy.com/Link.asp?I=LS000173120622", "snippet": "SCHLESINGER--Carl, 88, printer, linotype and labor union historian, composer of the official march of The New York Times, co-producer of Tap Extravaganza (R), tap dance enthusiast, wordsmith and author of printing history books. He was a proud New...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  SCHLESINGER, CARL "}, "word_count": "118", "keywords": [], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-10T19:14:26Z", "_id": "5461de2738f0d80b742a0225", "lead_paragraph": "<!-- CARL  SCHLESINGER -->SCHLESINGER--Carl, 88, printer, linotype and labor union historian, composer of the official march of The New York Times, co-producer of Tap Extravaganza (R), tap dance enthusiast, wordsmith and author of printing history books. He was a proud New York Times printer, educator and trainer for 35 years, and from 1967-73 established a printing school in Nairobi, Kenya. Producer and narrator of award-winning documentary, Farewell Etaoin Shrdlu; starring role in Linotype: the Film; and star of Heart and Sole: Twenty Years of Tap Extravaganza. Schlesinger is survived by his wife, Renee, daughters Laura (Craig) Minor, Barbara \"Tia\" (Michael) Amdurer, Jeanne Buesser, grandchildren and great-grandson. Donations to \"Schlesinger Fund\" NY Public Library, 445 5th Ave., NY NY 10016 or <a rel=\"nofollow\" href=\"www.NYPL.org\">www.NYPL.org</a><br/><br/><br><br>\n ", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": null, "web_url": "http://www.legacy.com/Link.asp?I=LS000173120621", "snippet": "PIROPATO--Teresa G. Passed away in her home in Lattingtown, NY on Sunday morning November 9, 2014. She was born on July 5, 1938 to the late Joseph and Anna Gentile. Beloved wife of Sal. Loving mother of Joseph Piropato, Elena Pierce and the late L...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  PIROPATO, TERESA "}, "word_count": "201", "keywords": [], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-10T19:14:25Z", "_id": "5461de2738f0d80b742a0223", "lead_paragraph": "<!-- TERESA PIROPATO -->PIROPATO--Teresa G.<br/><br/> Passed away in her home in Lattingtown, NY on Sunday morning November 9, 2014. She was born on July 5, 1938 to the late Joseph and Anna Gentile. Beloved wife of Sal. Loving mother of Joseph Piropato, Elena Pierce and the late Lisa Heffernan. Cherished grandmother of Leah Heffernan and Ethan and Julia Pierce. Dear sister of Dr. Andrew Gentile and Gayann Thomas. She had sixteen loving nieces and nephews. Awarded the title of Cavalier of the Order of Merit of the Republic of Italy, an internationally recognized honor given to individuals whose achievements contribute to Italian culture and service. Board member of The Long Island Breast Cancer Action Coalition, Coalition Against Child Abuse & Neglect, The Maurer Foundation, and The American Society of Italian Legion of Merit. Visitation at Oyster Bay Funeral Home, 261 South St., Oyster Bay NY 11771, from 3:00-5:00 and 7:00- 9:00pm on Wednesday, November 12. Funeral Mass at St. Gertrude RC Church, 28 School Street, Bayville, NY on Thursday, November 13 at 10:30am with interment at Locust Valley Cemetery. In lieu of flowers, please consider donations for metastatic breast cancer research to Memorial Sloan Kettering Cancer Center, 1275 York Ave. New York, NY 10063.<br><br>\n ", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": null, "web_url": "http://www.legacy.com/Link.asp?I=LS000173120620", "snippet": "LANDIS--Elayne S. Jewish Board of Family and Children's Services mourns the passing of Elayne S. Landis, who was a steadfast and generous supporter of JBFCS' Child Development Center. Our hearts and thoughts are with Elayne's family....", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  LANDIS, ELAYNE "}, "word_count": "36", "keywords": [], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-10T19:14:24Z", "_id": "5461de2638f0d80b742a021f", "lead_paragraph": "<!-- ELAYNE LANDIS -->LANDIS--Elayne S. Jewish Board of Family and Children's Services mourns the passing of Elayne S. Landis, who was a steadfast and generous supporter of JBFCS' Child Development Center. Our hearts and thoughts are with Elayne's family.<br/><br/><br><br>\n ", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": null, "web_url": "http://www.legacy.com/Link.asp?I=LS000173120619", "snippet": "BAUM--Judy. Departed this world suddenly and unexpectedly December 20, 2013, but can never leave my heart. \"i carry your heart with me (i carry it in my heart) i am never without it (anywhere i go you go, my dear; and whatever is done by only me i...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  BAUM, JUDY "}, "word_count": "104", "keywords": [], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-10T19:14:22Z", "_id": "5461de2438f0d80b742a0218", "lead_paragraph": "<!-- JUDY BAUM -->BAUM--Judy.<br/><br/> Departed this world suddenly and unexpectedly December 20, 2013, but can never leave my heart. \"i carry your heart with me (i carry it in my heart) i am never without it (anywhere i go you go, my dear; and whatever is done by only me is your doing, my darling) i fear no fate (for you are my fate, my sweet) i want no world (for beautiful you are my world, my true) and it's you are whatever a moon has always meant i carry your heart (i carry it in my heart)\" \"i carry your heart\" by e e Cummings IKE<br><br>\n ", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": null, "web_url": "http://www.legacy.com/Link.asp?I=LS000173120618", "snippet": "CHESER--Dolly Komarovsky With profound sadness, the family of Dolly Cheser shares news of her passing on November 5, at age 96. She was surrounded by her family, and will be lovingly remembered by her daughters, Ana Silbert and Nancy Cheser, her g...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  CHESER, DOLLY "}, "word_count": "66", "keywords": [], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-10T19:14:20Z", "_id": "5461de2538f0d80b742a021a", "lead_paragraph": "<!-- DOLLY CHESER -->CHESER--Dolly Komarovsky<br/><br/> With profound sadness, the family of Dolly Cheser shares news of her passing on November 5, at age 96. She was surrounded by her family, and will be lovingly remembered by her daughters, Ana Silbert and Nancy Cheser, her grand-daughters, Sarah Hinawi (Adel) and Ruth Storc (Michael), her great grandchildren, and many others. Her husband of 56 years, Solomon Cheser pre-deceased her in 2002.<br><br>\n ", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": null, "web_url": "http://www.legacy.com/Link.asp?I=LS000173120617", "snippet": "BLAIKIE--Donald. His smile will never be forgotten. We send our condolences to Sandy, his children, Jennifer, Nick, Peter, Dana and the Blaikie family. Larry and Adrienne Reinlieb...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  BLAIKIE, DONALD "}, "word_count": "27", "keywords": [], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-10T19:14:19Z", "_id": "5461de2438f0d80b742a0219", "lead_paragraph": "<!-- DONALD BLAIKIE -->BLAIKIE--Donald. His smile will never be forgotten. We send our condolences to Sandy, his children, Jennifer, Nick, Peter, Dana and the Blaikie family.<br/><br/> Larry and Adrienne Reinlieb<br><br>\n ", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}], "meta": {"hits": 871, "time": 80, "offset": 100}}}