{"status": "OK", "copyright": "Copyright (c) 2013 The New York Times Company.  All Rights Reserved.", "response": {"docs": [{"print_page": "30", "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9C0CE4D7103AF931A35752C1A9629D8B63", "snippet": "PEREIRA--Mortimer, of Manhattan, passed away on October 28, 2014 at age 96. Wonderful husband of Dorothy for over 50 years. Wonderful father to son Marshall and stepson Jeffrey Shaw and grandfather to three grandchildren and two great-grandchildre...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  PEREIRA, MORTIMER"}, "word_count": "37", "keywords": [{"value": "PEREIRA, MORTIMER", "name": "persons"}], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-02T00:00:00Z", "_id": "5460395938f0d873a2dbd3d1", "lead_paragraph": "PEREIRA--Mortimer, of Manhattan, passed away on October 28, 2014 at age 96. Wonderful husband of Dorothy for over 50 years. Wonderful father to son Marshall and stepson Jeffrey Shaw and grandfather to three grandchildren and two great-grandchildren.", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": "30", "web_url": "http://query.nytimes.com/gst/fullpage.html?res=950DE4D7103AF931A35752C1A9629D8B63", "snippet": "PATEL--Kunal. Kunal Patel, February 15, 1987 - October 23, 2014. We are celebrating the life of an extraordinary human being, Kunal Patel who was with us for 27 years and passed away on October 23rd after a tragic bike accident. Kunal was born and...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  PATEL, KUNAL"}, "word_count": "282", "keywords": [{"value": "PATEL, KUNAL", "name": "persons"}], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-02T00:00:00Z", "_id": "5460395838f0d873a2dbd3d0", "lead_paragraph": "PATEL--Kunal. Kunal Patel, February 15, 1987 - October 23, 2014. We are celebrating the life of an extraordinary human being, Kunal Patel who was with us for 27 years and passed away on October 23rd after a tragic bike accident. Kunal was born and raised in San Francisco Bay Area, CA, went to the University of Southern California for his undergraduate degree in Chemical Engineering and then received his Masters in Chemical Engineering from Cornell University. He was a research intern in nanotechnology at the NASA Ames Research center and most recently an entrepreneur; in true Silicon Valley style, he cofounded a company called Arevo Labs. At 27, he had accomplished more than most do in a lifetime. Kunal was a star athlete he was passionate about soccer, completed the Escape from Alcatraz and New York Triathlons, and was a 4.5 USA National tennis champion. He loved classical music and was an extraordinary traveler, backpacking through so many countries all over the world and always looking for off the beaten path experiences with great enthusiasm and energy. Most importantly, Kunal was kind, compassionate, affectionate, gentle, and always brimming with a zest for life. He taught us how to live life to the fullest, encouraging us to explore beyond our boundaries, and always coming up with new ideas for family and friends. He was our inspiration: an amazing son, a wonderful brother, and an extraordinary human being. Words cannot describe how much we will miss you Kunal but we are grateful for the years we had with you. Our blessings for your journey ahead and thank you for all you gave us. Our love will always be with you. Mom, Dad and Monique", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": "30", "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9402E4D7103AF931A35752C1A9629D8B63", "snippet": "NEWMAN--Terrie Lynne. October 15, a bright star joined heaven. She will be missed by husband Fred Kerstein, brother Bruce and sister Geraldine. Visit legacy.com...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  NEWMAN, TERRIE LYNNE"}, "word_count": "24", "keywords": [{"value": "NEWMAN, TERRIE LYNNE", "name": "persons"}], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-02T00:00:00Z", "_id": "5460395738f0d873a2dbd3cf", "lead_paragraph": "NEWMAN--Terrie Lynne. October 15, a bright star joined heaven. She will be missed by husband Fred Kerstein, brother Bruce and sister Geraldine. Visit legacy.com", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": "30", "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9B03E4D7103AF931A35752C1A9629D8B63", "snippet": "MILNER--Sheila. A devoted wife of Saladin Bucak; daughter of Sheila Casey and Michael J. Milner; sister of Michael Milner; and a caring aunt of Paula. Sheila was a conscientious, honest; courageous and outspoken person. She was a dedicated teacher...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  MILNER, SHEILA"}, "word_count": "187", "keywords": [{"value": "MILNER, SHEILA", "name": "persons"}], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-02T00:00:00Z", "_id": "5460395738f0d873a2dbd3ce", "lead_paragraph": "MILNER--Sheila. A devoted wife of Saladin Bucak; daughter of Sheila Casey and Michael J. Milner; sister of Michael Milner; and a caring aunt of Paula. Sheila was a conscientious, honest; courageous and outspoken person. She was a dedicated teacher who worked for about 40 years in the teaching profession. She was so passionate for the well being of humanity and justice. She was a very dedicated daughter, who took care of her mother for about 30 years. Her mother was suffering from Alzheimer's Disease, which she herself suffered with for about 14 years. Sheila always had a smile and a very positive outlook at life regardless of the difficult times she had to go through. She wanted to help everyone and believed that no matter what; life is worth living, regardless of the challenges we face. Let us celebrate the life of Sheila Milner; and always remember, life is challenging and the future is unpredictable for all of us but we have to make the best of each and everyday we are here. may the memory of Sheila remains in our hearts and minds now and forever.", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": "30", "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9901E4D7103AF931A35752C1A9629D8B63", "snippet": "MAZUR--Joseph A.,most remembered as a New York State Supreme Court Judge, officiated for over 33 years and was instrumental in clearing over 10,000 indictments. He was born the youngest of three siblings, on May 29, 1918 in the Lower Eastside, to ...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  MAZUR, JOSEPH A."}, "word_count": "422", "keywords": [{"value": "MAZUR, JOSEPH A.", "name": "persons"}], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-02T00:00:00Z", "_id": "5460395538f0d873a2dbd3cc", "lead_paragraph": "MAZUR--Joseph A.,most remembered as a New York State Supreme Court Judge, officiated for over 33 years and was instrumental in clearing over 10,000 indictments. He was born the youngest of three siblings, on May 29, 1918 in the Lower Eastside, to two Polish immigrants. Before graduating from DeWitt Clinton High School in the Bronx, he spent time as a varsity football fullback and a discus and shot put thrower on the track team. While attending Brooklyn College, World War II began. He was drafted into the U.S. Navy and spent the next three years dropping depth charges in the Gulf of Mexico. Joe supplemented his education during the War with USAFI courses at Ohio State University, and graduating from Brooklyn College at the conclusion of his service. While working full-time, delivering news papers, selling magazines and clerking in food stores, the young Mazur advanced to the job of Political and Educational Director for Local 22 of the International Ladies Garment Workers Union. These jobs were necessary to support his wife Helen and his two kids while he was obtaining his law degree from New York Law School. After graduating, he established the law firm of Mazur, Dontzin, Mazur and Dewitt, and shortly thereafter, became Counsel to the NYC Department of Labor, under Mayor Lindsey. Then he became Counsel to the New York State Department of Labor, first under Governor Harriman and then Governor Rockefeller. Mayor Lindsey appointed him to the Criminal Bench in 1965, where he was reappointed two more times under Mayor Koch. In 1985, The Judge was elected to the New York State Supreme Court, where he spent the rest of his judicial career. As a member of the Bronx Bar, he was revered by many attorneys for his hard work, intelligence, understanding and cooperation. After retiring in 1994, he continued on the bench, in various capacities, for an additional fifteen years. He was an adjunct professor of Labor Law at Cornell University and Rutgers Law School. He taught Commercial Law at Bronx Community College and taught grievance procedure to the prisoners at Sing Sing prison. The Judge was a wonderful loving and caring husband to the former Helen Schaffel for almost 70 years. He had two daughters, Bonnie Kirschenbaum, who pre-decreased him, and Sheryl Miller, who lives in Poughkeepsie, NY. The Judge is also survived by his two son-in-laws, Dr. Joel Miller and David Kirschenbaum; three grandsons, Daniel and Jonathan Miller, and Joshua Kirschenbaum; and five great grandchildren, Holden and Kieran Miller, Alison and Matthew Miller, and Sophia Kirschenbaum.", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": "30", "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9A00E4D7103AF931A35752C1A9629D8B63", "snippet": "MILLER--Joan. A \"Remembering Jo\" event will be held at 281 Woodland Rd., Highland Park, IL on November 25, 5-7pm....", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  MILLER, JOAN"}, "word_count": "19", "keywords": [{"value": "MILLER, JOAN", "name": "persons"}], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-02T00:00:00Z", "_id": "5460395638f0d873a2dbd3cd", "lead_paragraph": "MILLER--Joan. A \"Remembering Jo\" event will be held at 281 Woodland Rd., Highland Park, IL on November 25, 5-7pm.", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": "30", "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9806E4D7103AF931A35752C1A9629D8B63", "snippet": "LESSER--Lola, of New York City died on October 26, 2014. Born July 28, 1927 in Berlin Germany, Lola is survived by her three children: Jacquie Herz of Stamford, CT; Shoshana Angyalfi of Leeds, England; Roger Lewin of Ft. Lauderdale, FL. She was th...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  LESSER, LOLA"}, "word_count": "89", "keywords": [{"value": "LESSER, LOLA", "name": "persons"}], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-02T00:00:00Z", "_id": "5460395438f0d873a2dbd3cb", "lead_paragraph": "LESSER--Lola, of New York City died on October 26, 2014. Born July 28, 1927 in Berlin Germany, Lola is survived by her three children: Jacquie Herz of Stamford, CT; Shoshana Angyalfi of Leeds, England; Roger Lewin of Ft. Lauderdale, FL. She was the adored Nana to eight grandchildren: Jordie, Nikki, Chani, Yossi, Mendy, Rivki, Chaya, Moshe and a loving GG to 24 great-grandchildren. A very beautiful woman, both inside and out, Lola touched the hearts of everyone she knew. She will be truly missed by family and friends alike.", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": "30", "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9F07E4D7103AF931A35752C1A9629D8B63", "snippet": "LEE--Dr. Isabella, age 93, died October 24, in her home in New York City after a long illness. Widow of Chinese artist and teacher Jim Lee. Although she earned her Doctorate and was a Professor at NYU, her true calling and lifelong commitment, wor...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  LEE, DR"}, "word_count": "86", "keywords": [{"value": "LEE, DR", "name": "persons"}], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-02T00:00:00Z", "_id": "5460395338f0d873a2dbd3ca", "lead_paragraph": "LEE--Dr. Isabella, age 93, died October 24, in her home in New York City after a long illness. Widow of Chinese artist and teacher Jim Lee. Although she earned her Doctorate and was a Professor at NYU, her true calling and lifelong commitment, work, struggle, and passion was for women's rights, civil rights, the labor movement and peace. She is survived by her devoted friend and caregiver Linda King. Her intelligence, wit, humor, and caring will be sorely missed by many who knew and loved her.", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": "30", "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9E04E4D7103AF931A35752C1A9629D8B63", "snippet": "KOVER--Susan Deutsch, died on October 31 after a brave struggle. She was a teacher, librarian, storyteller, and mixed media artist. She is survived by her husband of forty-four years Andy; her children, Hillary and David and their spouses; and her...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  KOVER, SUSAN DEUTSCH"}, "word_count": "72", "keywords": [{"value": "KOVER, SUSAN DEUTSCH", "name": "persons"}], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-02T00:00:00Z", "_id": "5460395238f0d873a2dbd3c9", "lead_paragraph": "KOVER--Susan Deutsch, died on October 31 after a brave struggle. She was a teacher, librarian, storyteller, and mixed media artist. She is survived by her husband of forty-four years Andy; her children, Hillary and David and their spouses; and her loving grandson Sam. Funeral services will be held at Plaza Jewish Community Chapel at 11:30am on November 3. In lieu of flowers, please send a donation to the Leukemia & Lymphoma Society.", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}, {"print_page": "30", "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9D05E4D7103AF931A35752C1A9629D8B63", "snippet": "KINNELL--Galway. The MacDowell Colony wishes to acknowledge the life of poet Galway Kinnell, an extraordinary talent, teacher, and Colony friend. Galway was a great presence during seven residencies from 1959 to 1992. His poem \"Oatmeal\" stirs memo...", "multimedia": [], "section_name": "Paid Death Notices", "headline": {"main": "Paid Notice: Deaths  KINNELL, GALWAY"}, "word_count": "89", "keywords": [{"value": "KINNELL, GALWAY", "name": "persons"}], "source": "The New York Times", "byline": null, "news_desk": "Classified", "subsection_name": null, "document_type": "article", "abstract": null, "pub_date": "2014-11-02T00:00:00Z", "_id": "5460395138f0d873a2dbd3c8", "lead_paragraph": "KINNELL--Galway. The MacDowell Colony wishes to acknowledge the life of poet Galway Kinnell, an extraordinary talent, teacher, and Colony friend. Galway was a great presence during seven residencies from 1959 to 1992. His poem \"Oatmeal\" stirs memories of cooking his breakfast in a pot on the radiator in his studio at MacDowell. For the many wonderful volumes of poetry and prose, we thank him. His friendship will be remembered fondly by the staff, artists and board. Our deepest condolences to his family and wife, MacDowell board member Bobbie Bristol.", "slideshow_credits": null, "blog": [], "type_of_material": "Paid Death Notice"}], "meta": {"hits": 650, "time": 39, "offset": 20}}}