{"_id": "52d3659838f0d825af3156d9", "print_page": "21", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "GROSS--Dolores Veronica Farrell (Aunt Honey), age 83, a long-time resident of Rockville Centre, Long Island, died on Tuesday, December 31, 2013 in her home after a brief illness with metastatic lung cancer. Born on December 22, 1930 she is predece...", "document_type": "article", "subsection_name": null, "word_count": "187", "headline": {"main": "Paid Notice: Deaths  GROSS, DOLORES VERONICA FARRELL (AUNT HONEY)"}, "lead_paragraph": "GROSS--Dolores Veronica Farrell (Aunt Honey), age 83, a long-time resident of Rockville Centre, Long Island, died on Tuesday, December 31, 2013 in her home after a brief illness with metastatic lung cancer. Born on December 22, 1930 she is predeceased by her parents, Joseph and Pauline Farrell, her sister Rose Tator and her brother, George Farrell. She was the loving wife of William Gross, mother of Kevin and Keith Gross, grandmother of Olivia and Hunter Gross and beloved sister of Margaret Keefe and Dr. Patricia Farrell, mother-in-law of Maria Gross and Donna Gross and sister-in-law of Dr. Rita D. Posner. In addition, she is mourned by her 10 nieces and nephews and 10 great-nieces and great-nephews. During her lifetime, Aunt Honey was the central figure in her extended family while maintaining herself in computer services and has a lifetime of achievement of helping others to achieve their goals in life. Words fail to express her contributions to others. No funeral services will be held. Her remains will be cremated as was her wish In lieu of flowers, please make contributions to the cancer fund of your choice.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "GROSS, DOLORES VERONICA FARRELL"}], "pub_date": "2014-01-05T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9A02E4DD163AF936A35752C0A9629D8B63"}