{"_id": "5460395838f0d873a2dbd3d0", "print_page": "30", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "PATEL--Kunal. Kunal Patel, February 15, 1987 - October 23, 2014. We are celebrating the life of an extraordinary human being, Kunal Patel who was with us for 27 years and passed away on October 23rd after a tragic bike accident. Kunal was born and...", "document_type": "article", "subsection_name": null, "word_count": "282", "headline": {"main": "Paid Notice: Deaths  PATEL, KUNAL"}, "lead_paragraph": "PATEL--Kunal. Kunal Patel, February 15, 1987 - October 23, 2014. We are celebrating the life of an extraordinary human being, Kunal Patel who was with us for 27 years and passed away on October 23rd after a tragic bike accident. Kunal was born and raised in San Francisco Bay Area, CA, went to the University of Southern California for his undergraduate degree in Chemical Engineering and then received his Masters in Chemical Engineering from Cornell University. He was a research intern in nanotechnology at the NASA Ames Research center and most recently an entrepreneur; in true Silicon Valley style, he cofounded a company called Arevo Labs. At 27, he had accomplished more than most do in a lifetime. Kunal was a star athlete he was passionate about soccer, completed the Escape from Alcatraz and New York Triathlons, and was a 4.5 USA National tennis champion. He loved classical music and was an extraordinary traveler, backpacking through so many countries all over the world and always looking for off the beaten path experiences with great enthusiasm and energy. Most importantly, Kunal was kind, compassionate, affectionate, gentle, and always brimming with a zest for life. He taught us how to live life to the fullest, encouraging us to explore beyond our boundaries, and always coming up with new ideas for family and friends. He was our inspiration: an amazing son, a wonderful brother, and an extraordinary human being. Words cannot describe how much we will miss you Kunal but we are grateful for the years we had with you. Our blessings for your journey ahead and thank you for all you gave us. Our love will always be with you. Mom, Dad and Monique", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "PATEL, KUNAL"}], "pub_date": "2014-11-02T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=950DE4D7103AF931A35752C1A9629D8B63"}