{"_id": "5436026838f0d8435503818c", "print_page": "20", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "GRIFFO--William Paul. Beloved son of Drs. Yvona and William Griffo and brother Michael (\"BRO\") passed suddenly and peacefully on September 25, 2014. Born on Saturday, May 18, 1996, he was currently a senior at Poly Prep Country Day School where he...", "document_type": "article", "subsection_name": null, "word_count": "214", "headline": {"main": "Paid Notice: Deaths  GRIFFO, WILLIAM PAUL"}, "lead_paragraph": "GRIFFO--William Paul. Beloved son of Drs. Yvona and William Griffo and brother Michael (\"BRO\") passed suddenly and peacefully on September 25, 2014. Born on Saturday, May 18, 1996, he was currently a senior at Poly Prep Country Day School where he was a proud and loyal teammate on the varsity soccer, ice hockey and Lacrosse teams. In 2011, he graduated from St. David's School in New York City. William is survived by his beloved aunt, uncle and two cousins (Capitani family) in Staten Island, New York as well as a cousin, uncle and aunt (Kolar family in Prague, Czech Republic. His devoted sole surviving grandparent is Mary Ann Griffo. He was predeceased by maternal grandparents, Zdenka and Vladimir Kolar of Prague. William, this summer contributed community service at Marist Brothers Camp, an organization devoted to a dignified life for developmentally challenged adults. Contributing his humor, joy and talents as a counselor brought great happiness to William. In lieu of flowers, contributions to the Marist Brothers Center at Esopus Mid Hudson Valley Camps PO Box 197, Esopus, NY 12429 (esopuscamps.com). Visitation at Frank E Campbell 1076 Madison Ave (81st ST) on Thursday, October 2, 2014 from 7-9pm. Mass of Christian Burial at The Church of Saint Catherine of Siena, 411 East 68th Street, Friday 10am.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "GRIFFO, WILLIAM PAUL"}], "pub_date": "2014-10-01T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9D06E6D6123AF932A35753C1A9629D8B63"}