{"_id": "53c6e53438f0d858f3e37c5f", "print_page": "10", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "DUKE--Anthony Drexel Sr.,died peacefully in Gainesville, Florida, on April 30. He was 95. Tony Duke Sr. founded Boys and Girls Harbor in 1937 and served as its president and board chairman for many decades. The values he instilled in Harbor alumni...", "document_type": "article", "subsection_name": null, "word_count": "407", "headline": {"main": "Paid Notice: Deaths  DUKE, ANTHONY DREXEL SR."}, "lead_paragraph": "DUKE--Anthony Drexel Sr.,died peacefully in Gainesville, Florida, on April 30. He was 95. Tony Duke Sr. founded Boys and Girls Harbor in 1937 and served as its president and board chairman for many decades. The values he instilled in Harbor alumni were inspired in him at an early age at St. Paul's School, in Concord, NH, where he was a leader of the class of 1937. He later attended Princeton University, cutting his education short to join the US Navy. In his distinguished military career he was Commanding Officer of the USS LST 530 at Normandy and an LST Division Commander in the Pacific. He was awarded three battle stars and the Bronze Star. He later made missions to Vietnam for the International Rescue Committee, of which he was a board member. In 1980 he sailed to Cuba during the 1980 Mariel refugee crisis. Mr. Duke was a former vice chairman of the board of trustees of Duke University and a board member of many organizations throughout his life. He was the recipient of numerous honors, including honorary doctorates from Duke, Drexel, Adelphi and Long Island Universities. He received several Presidential citations for his leadership of Boys and Girls Harbor. Mr. Duke was a tireless advocate for inner-city youth and their families. He was a former commissioner of the New York City Youth Board and was active with Big Brothers, the Henry Street Settlement and many others. He was the son of Cordelia Drexel Biddle and Angier Buchanan Duke, and the brother of Ambassador Angier Biddle Duke. They were the grandsons of Benjamin N. Duke, who with his brother, James, heavily endowed Trinity College, which became Duke University. Mr. Duke is survived by his widow, Maria de Lourdes Alcebo, and ten children: Anthony Drexel Duke, Jr., Nicholas Rutgers Duke, Sr., Cordelia Duke Jung, Josephine Duke Brown, December Duke McSherry, John Ordway Duke, Douglas Drexel Duke, Lulita Duke Reed, Washington Alcebo Duke, and James Buchanan Duke. His son, Barclay Robertson Duke, died in 1989. He had 22 grandchildren and 10 great-grandchildren. A private family funeral service will be held on May 12 at St. John's Episcopal Church in Southampton, LI. There will also be a memorial celebration of the life of Tony Duke in New York City on a date later this spring to be announced. Contributions in memory of Tony Duke may be made to: Boys & Girls Harbor, One East 104th Street, New York, NY 10029.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "DUKE, ANTHONY DREXEL SR."}], "pub_date": "2014-05-02T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9402E4D7103AF931A35756C0A9629D8B63"}