{"_id": "53c0516738f0d871b1c31ee9", "print_page": "19", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "KING--Rollin White, passed away peacefully on Thursday, June 26, 2014 in Dallas, Texas from complications of a stroke. Mr. King was born in Cleveland, Ohio on April 10, 1931 to Griffin and Elizabeth King. He graduated from Shaker Heights High Scho...", "document_type": "article", "subsection_name": null, "word_count": "569", "headline": {"main": "Paid Notice: Deaths  KING, ROLLIN WHITE"}, "lead_paragraph": "KING--Rollin White, passed away peacefully on Thursday, June 26, 2014 in Dallas, Texas from complications of a stroke. Mr. King was born in Cleveland, Ohio on April 10, 1931 to Griffin and Elizabeth King. He graduated from Shaker Heights High School in Ohio, received his BA from Case Western Reserve and an MBA from Harvard Business School. Mr. King was an amazing entrepreneur who famously came up with the idea for Southwest Airlines, the world's most successful airline. His idea for better service, low cost air travel was revolutionary and changed air travel worldwide. He was the Founder and first Chairman and President of Southwest Airlines Co. and was a Director and an Executive Committee member from the formation of the company until he retired from the Board after 40 years in May 2006 at the age of 75. After leaving the management of the airline Mr. King engaged in other business ventures as well as led executive education seminars and he did consulting as a principal of Rollin King Associates until his retirement on December 31, 1995. Subsequently he was principally engaged in private investing. Mr. King had a passion for hunting and fishing, which he shared with his children and grandchildren. In particular he loved Africa, its people and wildlife. He went on more than 20 safaris during which he often enjoyed sitting around the fire listening to or telling stories with family and friends. He was happy to donate generously to a village school in Tanzania. He also was an avid golfer his entire life. He was a member of Brook Hollow Golf Club in Dallas, The Old Baldy Club in Saratoga, Wyoming; and Eldorado Country Club in Indian Wells, California, and served on the Board of Visitors for UT Southwestern University Hospitals and Clinics. He is a former member of Little Sandy Hunting and Fishing Club and the Chevaliers du Tastevin. At various times, he was a trustee of the Dallas Symphony, St. John's College of Annapolis, Maryland and Santa Fe, New Mexico, and the Dallas Museum of Art for which he served on the Executive Committee. He also was President of the Board of the Georgia O'Keeffe Museum in Santa Fe, New Mexico and Chairman of the Executive Committee of the College of Santa Fe. He was an Honorary Life Member of the Board of Directors of the School of American Research in Santa Fe and the Southwest Outward Bound School. He is survived by his children Rollin W. King, Jr. of San Antonio, and Edward P. King and his daughter-in-law Wendy of Dallas, stepchildren Claire Dewar, Tony Dewar and wife Juli, and Molly Froelich and husband Henry; grandchildren Ann E King, Rollin W. King, III, Ellie King, Prescott King, Charlie King, Grace Dewar, Johnny Dewar, Ella Froelich, and Hal Froelich; his sister Betty King of Washington DC and his friend and companion in his later life Anne Reed Rooth. He is predeceased by his wife Mary Ella Ownby King and first wife Marcia Gygli King and grandchild Will Froelich. In lieu of flowers, memorial contributions may be directed to Southwestern Medical Foundation, Reagan Place at Old Parkland, 3963 Maple Avenue, Suite 100, Dallas, TX 75219 or online at www.swmedical.org to support the Rollin and Mary Ella King Fund for Research and Treatment of Liver Diseases., or to the charity of your choice. A memorial service will be planned in the fall in Dallas.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "KING, ROLLIN WHITE"}], "pub_date": "2014-07-01T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9806E1DE163AF932A35754C0A9629D8B63"}