{"_id": "53c6e53338f0d858f3e37c5b", "print_page": "10", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "BEHRMAN--Fay. Passed away at 93 years of age in New York. Her extraordinary life spanned ten decades and three continents. She was a nurse for the Red Cross during and after World War II, during which time she cared for Holocaust survivors in the ...", "document_type": "article", "subsection_name": null, "word_count": "183", "headline": {"main": "Paid Notice: Deaths  BEHRMAN, FAY"}, "lead_paragraph": "BEHRMAN--Fay. Passed away at 93 years of age in New York. Her extraordinary life spanned ten decades and three continents. She was a nurse for the Red Cross during and after World War II, during which time she cared for Holocaust survivors in the Dachau concentration camp. She was whip-smart, elegant, opinionated, vivacious and deeply loyal. Fay loved South Africa (where she was born and raised her family), the arts, fine meals, her walks in Central Park and, above all, her family - to whom she was incredibly devoted. She adored them; and they adored her. Foremost among her devoted admirers were her late husband, Errol, her late son, Darryl and her son, Grant, who survives her. She is also survived by her daughters-in-law, Janine (Alan) and Shelley; her grandchildren Doug (Andrea), Kimmie, Amanda (Zac), and Greg (Caitlin); and her great-grandchildren Josh, Julia, Charlie, and Claire. All of them will miss her dearly, will forever cherish their precious memories of love and laughter with her, and will be graced with the honor of always being able to carry her indomitable spirit with them.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "BEHRMAN, FAY"}], "pub_date": "2014-05-02T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9E04E4D7103AF931A35756C0A9629D8B63"}