{"_id": "5436026e38f0d84355038190", "print_page": "20", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "MURPHY--Sheila T.,died at her home on September 28th. She was born in Yorkville, NYC, graduated from Lawrence Academy, the College of New Rochelle and received a Masters in Education from New York University. She married her beloved Francis T. Mur...", "document_type": "article", "subsection_name": null, "word_count": "178", "headline": {"main": "Paid Notice: Deaths  MURPHY, SHEILA T."}, "lead_paragraph": "MURPHY--Sheila T.,died at her home on September 28th. She was born in Yorkville, NYC, graduated from Lawrence Academy, the College of New Rochelle and received a Masters in Education from New York University. She married her beloved Francis T. Murphy on July 4, 1959. She is survived by her husband and five children, Timothy and his wife, Pamela; Eileen and her husband, Jeffrey Forsyth; Kathleen and her husband, Lance Scott; Sheila and her husband, Michael Sproule; Annemarie and her husband, Kevin Casey; and her brother Thomas Casey. Loving grandmother to Casey, Kaitlyn, Tim, Matthew, Sean, Patrick, Michael, Brendan, Megan and Liam. A gracious lady with a generous heart, strong religious beliefs and a non-judgmental nature. Friends may call on October 2nd from 4:00 to 8:00pm at Graham Funeral Home, 1036 Boston Post Road, Rye, NY. Mass of Christian burial at 10:00am on October 3rd at Our Lady of Perpetual Help, 575 Fowler Avenue, Pelham Manor, NY. Interment at St. Raymond's Cemetery. In lieu of flowers, please send donations to Calvary Hospital Hospice, 1740 Eastchester Road, Bronx, NY 10461.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "MURPHY, SHEILA T."}], "pub_date": "2014-10-01T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9902E6D6123AF932A35753C1A9629D8B63"}