{"_id": "5467242a38f0d87f029cd1b6", "print_page": null, "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "ZIMAND--Harvey Folks. Harvey Folks Zimand, passed away on November 10, 2014 peacefully at his home in New York City. He was 86. He was born in NYC and attended Friends Seminary, graduated from Colgate University, received a master's degree in poli...", "document_type": "article", "subsection_name": null, "word_count": "183", "headline": {"main": "Paid Notice: Deaths  ZIMAND, HARVEY "}, "lead_paragraph": "<!-- HARVEY ZIMAND --><IMG SRC=\"/Images/Cobrands/NYTimes/Photos/NYT-0001930885-ZIMANDH_22_034722004.1_191358.jpg\" lgyOrigName=\"NYT-0001930885-ZIMANDH_22_034722004.1.jpg\" ALIGN=\"LEFT\" vspace=\"4\" hspace=\"10\">ZIMAND--Harvey Folks.<br/><br/> Harvey Folks Zimand, passed away on November 10, 2014 peacefully at his home in New York City. He was 86. He was born in NYC and attended Friends Seminary, graduated from Colgate University, received a master's degree in political science at the University of Chicago, and his law degree from Yale University. After law school, he joined Kelley Drye & Warren where he became a partner and specialized as a trusts and estates attorney for over 50 years. He was selected as one of The Best Lawyers in America in the Trusts & Estates and Litigation for over twenty years. He was a lifelong resident of New York City and spent many summers with his family in Randolph, New Hampshire, where he loved to hike and was a member of the Randolph Hiking Club. Mr. Zimand is survived by his two daughters, Patty Carpenter and Stephanie Plexico, his four grandchildren and his stepsons Chris Manfre and Mark Manfre and their two sons. Funeral services will be held on Saturday November 22, 2014 at 1:30pm at Frank E Campbell, The Funeral Chapel.<br><br>\n ", "slideshow_credits": null, "keywords": [], "pub_date": "2014-11-14T19:14:09Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://www.legacy.com/Link.asp?I=LS000173170138"}