{"_id": "531be7bb38f0d85d201f756c", "print_page": "10", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "EBERSTADT--Walter. Died February 26, 2014 at home. Born July 15, 1921 in Frankfurt, Germany, Walter Eberstadt moved with his family to England in 1936 to escape Nazi persecution and was educated at Oxford University. In WWII, he was first interned...", "document_type": "article", "subsection_name": null, "word_count": "582", "headline": {"main": "Paid Notice: Deaths  EBERSTADT, WALTER"}, "lead_paragraph": "EBERSTADT--Walter. Died February 26, 2014 at home. Born July 15, 1921 in Frankfurt, Germany, Walter Eberstadt moved with his family to England in 1936 to escape Nazi persecution and was educated at Oxford University. In WWII, he was first interned, then released to the Pioneer Corps for domestic service. When \"enemy aliens\" were allowed to join fighting units, he transferred to the Oxfordshire and Buckinghamshire Light Infantry and fought in Normandy where he was wounded in August of 1944. He was posted back to Germany at the beginning of the reconstruction, having risen to the rank of major, in charge of \"Radio Hamburg,\" and then spent three years in London writing for the Economist. In 1951 he immigrated to the United States, where he began a highly successful career in investment banking, first at Lehman Brothers and later at Lazard Freres, becoming a partner there in 1970. He was an innovator in the field of closed-end mutual funds, establishing a number of successful international investment partnerships. Walter married Vera von Kuffner in 1964, and had two sons, Michael and George. He was a loving grandfather to Max, Zoe, Esme, and Maya and adored his daughters-in-law, Nina Beattie and Cynthia Young. His sister, Bridget, who married his Oxford friend James Collier and passed away in 2013, remained in England with his parents, and his two nieces Caroline and Lucy and their families live there. Walter served as a Trustee of the New School University for 39 years where he was instrumental in preserving the legacy of the University in Exile and was awarded an Honorary Doctorate in 1996. As President of the Northside Center for Child Development, Board Member of the American Council on Germany, Chairman of the Martha's Vineyard Preservation Trust, Board Member of the St. Bernard's School, and Chairman of the Advisory Board of the World Policy Institute, Walter guided great institutions with wisdom and acumen. He had an elegant way about him, and delicate matters benefited from his respectful and diplomatic approach. During his last 10 years, The Frick Collection, where he served as a Trustee, becoming Vice Chair of the Board, was his great passion. He supported many exhibitions and scholarly endeavors at both the museum and the library, and he constantly enlarged the circle of supporters of the Frick through his sheer enthusiasm and love of the institution. In his many international business and volunteer activities, Walter built bridges between his three countries of citizenship, and he was honored with both an OBE from England and the Order of Merit from Germany. Walter had a keen intellect and wide range of interests in literature, music, and art. He authored \"Whence We Came, Where We Went\" (2002), a book tracing the history of his remarkable family back to its origins in Germany. He had a special passion for sailing, centered in Edgartown on Martha's Vineyard, where he and his family spent happy summers for nearly fifty years. He was always open to new things. He was at home everywhere, and exuded charm and a profound love of and pride in his family. Everyone who came into his world was touched by his generosity of spirit and love of life. His many friends will miss his conversational wit, kindness, and resilient spirit. Contributions in Walter's memory may be made to the Frick Collection frick.org/support/annual--fund and the New School www.newschool.edu/eberstadt There will be an open memorial service on Monday, March 3 at 11am at the Frick Collection, 1 East 70th Street.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "EBERSTADT, WALTER"}], "pub_date": "2014-03-01T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9B06E5DA153AF932A35750C0A9629D8B63"}