{"_id": "5460395538f0d873a2dbd3cc", "print_page": "30", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "MAZUR--Joseph A.,most remembered as a New York State Supreme Court Judge, officiated for over 33 years and was instrumental in clearing over 10,000 indictments. He was born the youngest of three siblings, on May 29, 1918 in the Lower Eastside, to ...", "document_type": "article", "subsection_name": null, "word_count": "422", "headline": {"main": "Paid Notice: Deaths  MAZUR, JOSEPH A."}, "lead_paragraph": "MAZUR--Joseph A.,most remembered as a New York State Supreme Court Judge, officiated for over 33 years and was instrumental in clearing over 10,000 indictments. He was born the youngest of three siblings, on May 29, 1918 in the Lower Eastside, to two Polish immigrants. Before graduating from DeWitt Clinton High School in the Bronx, he spent time as a varsity football fullback and a discus and shot put thrower on the track team. While attending Brooklyn College, World War II began. He was drafted into the U.S. Navy and spent the next three years dropping depth charges in the Gulf of Mexico. Joe supplemented his education during the War with USAFI courses at Ohio State University, and graduating from Brooklyn College at the conclusion of his service. While working full-time, delivering news papers, selling magazines and clerking in food stores, the young Mazur advanced to the job of Political and Educational Director for Local 22 of the International Ladies Garment Workers Union. These jobs were necessary to support his wife Helen and his two kids while he was obtaining his law degree from New York Law School. After graduating, he established the law firm of Mazur, Dontzin, Mazur and Dewitt, and shortly thereafter, became Counsel to the NYC Department of Labor, under Mayor Lindsey. Then he became Counsel to the New York State Department of Labor, first under Governor Harriman and then Governor Rockefeller. Mayor Lindsey appointed him to the Criminal Bench in 1965, where he was reappointed two more times under Mayor Koch. In 1985, The Judge was elected to the New York State Supreme Court, where he spent the rest of his judicial career. As a member of the Bronx Bar, he was revered by many attorneys for his hard work, intelligence, understanding and cooperation. After retiring in 1994, he continued on the bench, in various capacities, for an additional fifteen years. He was an adjunct professor of Labor Law at Cornell University and Rutgers Law School. He taught Commercial Law at Bronx Community College and taught grievance procedure to the prisoners at Sing Sing prison. The Judge was a wonderful loving and caring husband to the former Helen Schaffel for almost 70 years. He had two daughters, Bonnie Kirschenbaum, who pre-decreased him, and Sheryl Miller, who lives in Poughkeepsie, NY. The Judge is also survived by his two son-in-laws, Dr. Joel Miller and David Kirschenbaum; three grandsons, Daniel and Jonathan Miller, and Joshua Kirschenbaum; and five great grandchildren, Holden and Kieran Miller, Alison and Matthew Miller, and Sophia Kirschenbaum.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "MAZUR, JOSEPH A."}], "pub_date": "2014-11-02T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9901E4D7103AF931A35752C1A9629D8B63"}