{"_id": "53e58f7a38f0d83b812510e1", "print_page": "17", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "FAIR--Charles M.Charles M. Fair, 97, of Wakefield, Rhode Island, died July 28, 2014 at South County Hospital in Wakefield, of lymphoma. He was a multitalented man with a varied career: editor, poet, banana importer, computer-company executive, scr...", "document_type": "article", "subsection_name": null, "word_count": "433", "headline": {"main": "Paid Notice: Deaths  FAIR, CHARLES M.CHARLES M"}, "lead_paragraph": "FAIR--Charles M.Charles M. Fair, 97, of Wakefield, Rhode Island, died July 28, 2014 at South County Hospital in Wakefield, of lymphoma. He was a multitalented man with a varied career: editor, poet, banana importer, computer-company executive, script writer/ narrator, historian, and neurology researcher at Massachusetts General Hospital. In 1963 he went as a Guggenheim Fellow to UCLA's Brain Research Institute, and the following year became a resident scientist in MIT's Neurosciences Research Program, one of the few to have held an appointment there with no academic degree. Mr. Fair published light verse in Punch and The New Yorker, book reviews in the Washington Post and The Providence Journal, and a regular column in the American Poetry Review. He authored three books on neuroscience, The Physical Foundations of the Psyche (Wesleyan University Press, 1963), Memory & Central Nervous Organization (Paragon House, 1988), and Cortical Memory Functions (Birkhauser, 1992); a number of papers on brain function; and three nontechnical books: The Dying Self (Wesleyan University Press, 1969), From The Jaws of Victory (Simon & Schuster, 1971), and The New Nonsense (Simon & Schuster, 1974). His books have been published in Britain and translated into Italian, German, and Danish. His creativity also included a lifelong love of jazz, and he played both piano and vibraphone. He loved sailing, the Red Sox, good conversation, and he even tried his hand at farming. He also wrote and narrated the soundtrack for the original Salem Witch Museum, in Salem, Massachusetts. The only child of Charles Maitland Fair and Gertrude (Bryan) Fair, he was born in New York City and was raised in Manhattan and in Oyster Bay, New York. He attended the Buckley School, the Fay School, St. Paul's School, and Yale University. Charles is survived by his wife of 34 years, Louise (Sadler) Kiessling M.D., FAAP, and two daughters, Ellen Bryan Fair of New York City and Shushan, New York, and Katherine Healy Fair, Ph.D., and her husband, Raphael Colb, of Fort Ann, NY and Exeter, NH. He was predeceased by his son, Charles M. (Chip) Fair, and his former wife Kay (Ruddy) Fair. A gathering in his honor will be held at the South Kingstown Land Trust Barn at 17 Matunuck Beach Road, Wakefield, RI 02879 on Sunday August 17 at 2:00pm. Burial will be private. In lieu of flowers, please send contributions to Home and Hospice Care of Rhode Island, South Team, 1085 N. Main Street, Providence, RI 02904; South County Hospital, 100 Kenyon Avenue, Wakefield, RI 02879; or the Rhode Island Food Bank, 200 Niantic Avenue, Providence, RI 02907. For guest book and condolences, averystortifuneralhome.com.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "FAIR, CHARLES M.CHARLES M"}], "pub_date": "2014-08-01T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9501E4D8173AF932A3575BC0A9629D8B63"}