{"_id": "53c0521d38f0d871b1c31f1b", "print_page": "19", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "INTRILIGATOR--Michael, an internationally renowned UCLA economist, died in Los Angeles June 23, age 76. He was an expert in economic theory, econometrics, health economics, strategy and arms control, peace and security, and transitioning economies...", "document_type": "article", "subsection_name": null, "word_count": "200", "headline": {"main": "Paid Notice: Deaths  INTRILIGATOR, MICHAEL"}, "lead_paragraph": "INTRILIGATOR--Michael, an internationally renowned UCLA economist, died in Los Angeles June 23, age 76. He was an expert in economic theory, econometrics, health economics, strategy and arms control, peace and security, and transitioning economies. He wrote, edited, or co-edited more than 300 published papers, journal articles, and books, including the 28-volume Handbook of Economics series and the influential, enduring textbook Mathematical Optimization and Economic Theory. He was a passionate educator and a much sought-after public speaker. Among his many honors, he was the only US economist to be elected a Foreign Member of the Russian Academy of Sciences. He was also a member of both the International Institute for Strategic Studies and the Council on Foreign Relations, as well as a fellow of the American Association for the Advancement of Science and the Econometric Society. Mike was a warm, gentle, and generous man. He loved family, teaching, colleagues, classical music, and coconut cake. Born in Freeport, NY, he received degrees from MIT and Yale. He is survived by his wife Devrie, their four sons, nine grandchildren, and his brother Marc. Donations may be made in his name to Economists for Peace and Security (epsusa.org) or to the American Cancer Society.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "INTRILIGATOR, MICHAEL"}], "pub_date": "2014-07-02T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9B05E6DD163AF931A35754C0A9629D8B63"}