{"_id": "52f84fc738f0d81bf5cabc58", "print_page": "21", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "FRIEDMAN--Dr. Raymond, of Palm Beach, Florida and Lenox, MA, died peacefully on January 20 just weeks before his 92nd birthday. As a research chemist, Dr. Friedman held positions in research and management at Westinghouse Research Laboratories, At...", "document_type": "article", "subsection_name": null, "word_count": "232", "headline": {"main": "Paid Notice: Deaths  FRIEDMAN, DR"}, "lead_paragraph": "FRIEDMAN--Dr. Raymond, of Palm Beach, Florida and Lenox, MA, died peacefully on January 20 just weeks before his 92nd birthday. As a research chemist, Dr. Friedman held positions in research and management at Westinghouse Research Laboratories, Atlantic Research Corporation and Factory Mutual Insurance Corporation of Norwood, MA., from which he retired as Vice President of Research. His many professional and academic honors include positions of leadership with the Combustion Institute, the American Chemical Society of Fuel Chemistry, the International Association for Fire Safety Science, the National Aeronautics and Space Administration and the National Academy of Science. Ray was also a member of the Cosmos Club. Known for his keen wit and analytical mind, Ray enjoyed classical music at the Society of the Four Arts in Palm Beach and Tanglewood in the Berkshires. The eclectic nature of Ray's intellect is reflected in the wide range of his publications. He is the author of the definitive text on fire prevention as well as other publications including The Foreseeable Future. Ray and his adored best friend and wife of 68 years, Myra, enjoyed traveling to all parts of the world. Besides his beloved wife, Ray leaves behind a galaxy of devoted cousins in Pittsburgh, a brother, Irving Friedman of Williamsburg, Virginia and friends who will never forget his loyalty kindness, patience and love. Funeral services were handled by Avatar Cremation Services of North Palm Beach.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "FRIEDMAN, DR"}], "pub_date": "2014-02-02T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9807EFD6173AF931A35751C0A9629D8B63"}