{"_id": "52f84fdc38f0d81bf5cabc67", "print_page": "21", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "KOVALESKI--Manya. Beloved and cherished wife of Fred, mother of Serge and mother-in-law of Jo, passed away on January 23, 2014. Born in Cairo, Egypt to parents who left Russia during the Bolshevik Revolution, Manya was a true internationalist bles...", "document_type": "article", "subsection_name": null, "word_count": "477", "headline": {"main": "Paid Notice: Deaths  KOVALESKI, MANYA"}, "lead_paragraph": "KOVALESKI--Manya. Beloved and cherished wife of Fred, mother of Serge and mother-in-law of Jo, passed away on January 23, 2014. Born in Cairo, Egypt to parents who left Russia during the Bolshevik Revolution, Manya was a true internationalist blessed with extraordinary beauty, grace and a deep sense of compassion. She was a socially sought-after member of every community in which she lived. As part of Cairo's exclusive social milieu in the 1950's, she was often in the company of members of the Royal family, and King Farouk himself often enjoyed greeting her with the few Russian words he knew. Manya was a loving, inspirational mother whose guiding philosophy was that \"life is beautiful\" and \"out of everything bad, comes something good.\" Educated at the Lycee Francais and English Mission College, she was conversant in six languages: French, English, Russian, Italian, Greek and Arabic. Following her marriage to Fred, this sophisticated and highly intuitive woman played a big role in furthering her husband's career as an international business executive. Over the span of nearly 20 years, his assignments took them to Cairo, Beirut, Khartoum, Yemen, Cape Town and Sydney. During their stay in Khartoum, the Station Chief for the CIA learned that Manya was a polyglot and recruited her to translate the tapes of wire-taps done on the Soviet Embassy. Manya was also witness to two revolutions overthrowing Sudanese governments. In Cape Town, Manya gave birth to her beloved son, Serge, who then spent several of his early years in Sydney. Once again, Manya showed her flair for fashion and was the subject of articles and pictorial features in such publications as Vogue magazine, Women's Wear Daily and the Sydney Morning Herald. Manya also had a talent for interior decorating, creating chic and comfortable homes for her family in the Point Piper section of Sydney and on Manhattan's Park Avenue, where she lived for more than four decades. Manya was a true socialite, hosting lavish dinners for friends and always attracting an eclectic mix of guests. Special among them was Oleg Cassini, the renowned fashion designer who became a life-long friend. Mr. Cassini, recognizing Manya's sense of style, proposed she join him in a new retail venture in which she would be the fashion director. As tempting as it was for Manya, she was a devoted mother to Serge, who was around 10 at the time, and declined the offer. During her many years abroad, Manya enjoyed memberships in a number of exclusive clubs including The Gezira Sporting Club (Cairo), The American University Alumni Club (Beirut), Rondebosch Tennis Club (Cape Town), White City Tennis Club and The American National Club (Sydney). In New York City, she belonged to the dining club, Doubles. Manya was also an extraordinary mother to two other children, from a previous marriage: Claudine, who passed away in 2007, and Pierre, who lives in France.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "KOVALESKI, MANYA"}], "pub_date": "2014-02-02T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9C02EED6173AF931A35751C0A9629D8B63"}