{"_id": "53e8329138f0d84035b58204", "print_page": "22", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "COURSON--Pearl \"Penny,\" passed away peacefully Friday July 11, 2014 at her home in Santa Barbara, CA after a long battle with cancer at the age of 90. Born September 14, 1923 in Chicago, IL, Penny was the daughter of the late Paul Schmidt of Vienn...", "document_type": "article", "subsection_name": null, "word_count": "252", "headline": {"main": "Paid Notice: Deaths  COURSON, PEARL \"PENNY,\" PASSED AWAY PEACEFULLY FRIDAY JULY 11"}, "lead_paragraph": "COURSON--Pearl \"Penny,\" passed away peacefully Friday July 11, 2014 at her home in Santa Barbara, CA after a long battle with cancer at the age of 90. Born September 14, 1923 in Chicago, IL, Penny was the daughter of the late Paul Schmidt of Vienna, Austria and the late Margaret Jarvis Schmidt of Illinois. She is survived by her daughter Judith Courson Burton, granddaughter Emily Burton and husband Chris McGillin, grandson James Burton and wife Deja Rabb Burton, and her great-grandchildren Everett, Simone, and Colette. She was preceded in death by her daughter Pamela Courson Morrison and husband Columbus \"Corky\" Courson. A child of the depression Penny overcame tough circumstances. After she married Corky they traveled the world. She was a connoisseur of the arts and worked as an interior designer. She was a homemaker and great cook who loved to entertain for family and friends. Penny was a staunch liberal with a feisty personality. She loved politics and was a lifelong reader of The New York Times. She loved her Bichon Frise Lola and her dearest friend Jaime Camargo, who cared for her and her husband when they took ill. Penny's ashes will be interred next to the love of her life, her husband of 64 years. Memorial services will take place at the Santa Barbara Cemetery chapel on August 16th at 1pm. In lieu of flowers, please consider donating to the Jim Morrison Film Award at UCLA or The Santa Barbara Hospice, which was very helpful in her last days.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "COURSON, PEARL \"PENNY,\" PASSED AWAY PEACEFULLY FRIDAY JULY 11"}], "pub_date": "2014-08-03T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9E01E2D7173AF930A3575BC0A9629D8B63"}