{"_id": "52d3658638f0d825af3156c8", "print_page": "21", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "BRANDT--Helene. Artist and Teacher. Born in Philadelphia on September 17, 1936, died on August 27, 2013 of sudden cardiac arrest. 1970 B.A. City College, Phi Beta Kappa. 1976 Certificate of Advanced Studies, St. Martin's School of Art, London. 197...", "document_type": "article", "subsection_name": null, "word_count": "228", "headline": {"main": "Paid Notice: Deaths  BRANDT, HELENE"}, "lead_paragraph": "BRANDT--Helene. Artist and Teacher. Born in Philadelphia on September 17, 1936, died on August 27, 2013 of sudden cardiac arrest. 1970 B.A. City College, Phi Beta Kappa. 1976 Certificate of Advanced Studies, St. Martin's School of Art, London. 1975 MFA Columbia University. 1985 Guggenheim Fellow. Review NY Times May 12, l989 \"Helene Brandt\" by Michael Brenson. Many solo and group shows - for CV see helenebrandt.com. I was blessed to be Helene's husband. We were married when she was just 18. We grew up, raised a family, and grew old together. We shared a love of classical music, hiking, camping, travel and living abroad. Helene loved languages and became fluent in French, Danish, and Italian. Most of all Helene loved making art in her studio at 43 Great Jones Street, NoHo. Many writers have created fantasy worlds, populated with unusual forms of life and explored by heroic mortals. Helene sculpted a welded steel collection of imaginary forms of life as well as her signature cages. It was her fantasy world and she was its hero. Her later work combined steel with other more organic materials like vegetables and roots in wall pieces that expanded her magic world. She has left us all grieving: her husband, Philip; two sons, David and Daniel; a daughter-in-law, Kristin; two grandchildren, Alexander and Christopher; and many friends and students. It must be so.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "BRANDT, HELENE"}], "pub_date": "2014-01-05T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9504E5DD163AF936A35752C0A9629D8B63"}