{"_id": "52d3659738f0d825af3156d8", "print_page": "21", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "GRIFFITHS--Jeanne McAlister, beloved daughter, caring sibling, adoring mother, and soul mate of her spouse, died on December 30th in Hudson, NY. She was 56 years young. Jeanne attended Friends Seminary in New York City, graduated from the Universi...", "document_type": "article", "subsection_name": null, "word_count": "264", "headline": {"main": "Paid Notice: Deaths  GRIFFITHS, JEANNE MCALISTER"}, "lead_paragraph": "GRIFFITHS--Jeanne McAlister, beloved daughter, caring sibling, adoring mother, and soul mate of her spouse, died on December 30th in Hudson, NY. She was 56 years young. Jeanne attended Friends Seminary in New York City, graduated from the University of Rochester and attended the Cornell School of Hotel Management in Paris and Ithaca. Upon graduating, Jeanne entered the world of hospitality, where she held major roles in the banquet departments for some of the finest hotels in New York, including Hotel Macklowe, the Stanhope and the Waldorf Astoria. Jeanne and her husband, Chip, left the hotel world to start their catering company, Tastefully Done, which they operated in the NYC area for nearly 20 years. As her own boss, Jeanne, with her partner, Chip, took as much pride in the freedom to attend every one of their children's sports games as she did in the wonderful events they hosted for their clients. In 2010, Jeanne and Chip left the greater New York City area and relocated upstate to Hudson, NY. Jeanne is survived by her parents, Irma and Andrew Hilton, her two younger sisters, Debbie McAlister Jones and Liz Hilton Segel, her brothers-in-law, Christopher Jones and Seth Segel, her nephews and niece Kyle, Cary, Conor, Daniel and Kate. She will be deeply missed by them and her two sons, Brad and James, her husband and best friend, Chip, and her 11 month-old German Shepherd puppy, Dutch. A memorial service will be held at the Friends Seminary Meeting House in New York (corner of East 15th Street and Rutherford Place) on Friday, January 10th at 6pm.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "GRIFFITHS, JEANNE MCALISTER"}], "pub_date": "2014-01-05T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9903E4DD163AF936A35752C0A9629D8B63"}