{"_id": "5461de2738f0d80b742a0223", "print_page": null, "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "PIROPATO--Teresa G. Passed away in her home in Lattingtown, NY on Sunday morning November 9, 2014. She was born on July 5, 1938 to the late Joseph and Anna Gentile. Beloved wife of Sal. Loving mother of Joseph Piropato, Elena Pierce and the late L...", "document_type": "article", "subsection_name": null, "word_count": "201", "headline": {"main": "Paid Notice: Deaths  PIROPATO, TERESA "}, "lead_paragraph": "<!-- TERESA PIROPATO -->PIROPATO--Teresa G.<br/><br/> Passed away in her home in Lattingtown, NY on Sunday morning November 9, 2014. She was born on July 5, 1938 to the late Joseph and Anna Gentile. Beloved wife of Sal. Loving mother of Joseph Piropato, Elena Pierce and the late Lisa Heffernan. Cherished grandmother of Leah Heffernan and Ethan and Julia Pierce. Dear sister of Dr. Andrew Gentile and Gayann Thomas. She had sixteen loving nieces and nephews. Awarded the title of Cavalier of the Order of Merit of the Republic of Italy, an internationally recognized honor given to individuals whose achievements contribute to Italian culture and service. Board member of The Long Island Breast Cancer Action Coalition, Coalition Against Child Abuse & Neglect, The Maurer Foundation, and The American Society of Italian Legion of Merit. Visitation at Oyster Bay Funeral Home, 261 South St., Oyster Bay NY 11771, from 3:00-5:00 and 7:00- 9:00pm on Wednesday, November 12. Funeral Mass at St. Gertrude RC Church, 28 School Street, Bayville, NY on Thursday, November 13 at 10:30am with interment at Locust Valley Cemetery. In lieu of flowers, please consider donations for metastatic breast cancer research to Memorial Sloan Kettering Cancer Center, 1275 York Ave. New York, NY 10063.<br><br>\n ", "slideshow_credits": null, "keywords": [], "pub_date": "2014-11-10T19:14:25Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://www.legacy.com/Link.asp?I=LS000173120621"}