{"_id": "5436026138f0d84355038189", "print_page": "20", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "CONNAUGHTON--Rev. Msgr. Lawrence M.,who was a priest of the Archdiocese of New York since his ordination in 1970 by then Archbishop Terrance Cardinal Cook at the Cathedral of St. Patrick, died September 29. He was appointed a Prelate of Honor of H...", "document_type": "article", "subsection_name": null, "word_count": "336", "headline": {"main": "Paid Notice: Deaths  CONNAUGHTON, REV. MSGR. LAWRENCE M."}, "lead_paragraph": "CONNAUGHTON--Rev. Msgr. Lawrence M.,who was a priest of the Archdiocese of New York since his ordination in 1970 by then Archbishop Terrance Cardinal Cook at the Cathedral of St. Patrick, died September 29. He was appointed a Prelate of Honor of His Holiness, Reverend Monsignor in August 1990 and at the time of his passing was pastor of St. John Nepomucene Church and administrator of St. John the Martyr Church in Manhattan, where he had served since 2012. He was 70. Born to the late Frank and Elizabeth Connaughton, in West Brighton, Staten Island, NY on April 24, 1944, he attended Sacred Heart Elementary School and St. Peter's High School before St. Joseph's Seminary in Yonkers, NY. For the next 44 years he served in a number of parishes throughout the Archdiocese and also held a number of administrative roles within the Archdiocese of New York during his priesthood. Most notably he was Dean of Students and Procurator to St. Joseph's Seminary (1983-1988), Vice Chancellor and Director of Priest's Personnel (1988-1990) and Executive Director of Development in the early 1990's. He was also a trustee of the Alfred E. Smith Memorial Foundation since 1990. He was predeceased by his sister Maura E. Mannion (Raymond P.) of Suffern, NY and is survived by his siblings John F. (Anne) of Trumbull, CT and Kathleen Cleary (Dennis) of Astoria Queens, NY along with nine nieces and nephews and eleven great nieces and nephews. The family will receive visitors at the Church of St. Joseph in the Yorkville neighborhood of Manhattan (404 East 87th St.) on Wednesday, October 1, 3pm 7pm. The Mass of Christian Burial will be celebrated on Thursday, October 2 at 10am at the Church of St. Joseph with burial to follow at St. Peter's Cemetery in Staten Island. In lieu of flowers, the family has requested that memorial gifts be made to Catholic Relief Services (crs.org) PO Box 17090, Baltimore, MD 21297-0303 or Catholic Near East Welfare Association (cnewa.org), 1011 1st Ave, New York, NY 10022-4195.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "CONNAUGHTON, REV. MSGR. LAWRENCE M."}], "pub_date": "2014-10-01T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9405E6D6123AF932A35753C1A9629D8B63"}