{"_id": "53e8329738f0d84035b5820b", "print_page": "22", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "HSU--Dan. Also named Xu I-Cheng: renowned Chinese-American artist, died on Thursday, July 31, 2014 in Gillette, NJ. He was 83. Born on April 11, 1931 in the city of Hangzhou, in the Zhejiang Province of China, he started to paint at the age of sev...", "document_type": "article", "subsection_name": null, "word_count": "307", "headline": {"main": "Paid Notice: Deaths  HSU, DAN"}, "lead_paragraph": "HSU--Dan. Also named Xu I-Cheng: renowned Chinese-American artist, died on Thursday, July 31, 2014 in Gillette, NJ. He was 83. Born on April 11, 1931 in the city of Hangzhou, in the Zhejiang Province of China, he started to paint at the age of seven. He studied traditional Chinese painting under a number of famous artists, and obtained advanced degrees in art and architecture from several Chinese universities. Starting in 1955, he served for 30 years as a professor of art and architecture at China Southeast University. Having resided in the United States since 1985, he was a member of the California Art Association and the Rutgers University Art Museum (as a special invitational member). He has authored several books and his work has been exhibited widely both in China and in America including in New York, California, Houston, New Jersey, Shanghai, Hangzhou, Beijing, and Nanjing. He participated in the design of the Astor Chinese Garden Court, completed in 1981, at the Metropolitan Museum of Art in New York City. In 2011 and 2012, he donated over 300 pieces of art to be preserved for generations to come, held by two museums in his hometown the Hangzhou Arts and Crafts Museum, which contains a dedicated exhibition hall of his work, and Hangzhou's West Lake Museum, which holds in trust a collection of his paintings. He will be remembered for his tireless commitment to teaching, and his lifelong dedication to his artistic ideal, bringing to life traditional Chinese painting in a contemporary context. He has been lauded in the media as a \"dual prodigy of painter and architect,\" and \"China's Monet.\" He will be buried at Ferncliff Cemetery in Hartsdale, New York. The wake will be held at 4pm, with a funeral service at 6pm, on Friday, August 8, 2014 at the Higgins Home for Funerals, Watchung, NJ.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "HSU, DAN"}], "pub_date": "2014-08-03T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9C04E1D7173AF930A3575BC0A9629D8B63"}