{"_id": "53c6f65b38f0d858f3e381d1", "print_page": "22", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "MacGRATH--Edward Wardlaw, age 83, died May 30, 2014 after a long illness. He is survived by his beloved wife, Cynthia Chandler MacGrath, his daughter, Dana Chandler MacGrath, and her husband Anthony Mathias Candido, and two grandchildren, Nico Cha...", "document_type": "article", "subsection_name": null, "word_count": "178", "headline": {"main": "Paid Notice: Deaths  MACGRATH, EDWARD WARDLAW"}, "lead_paragraph": "MacGRATH--Edward Wardlaw, age 83, died May 30, 2014 after a long illness. He is survived by his beloved wife, Cynthia Chandler MacGrath, his daughter, Dana Chandler MacGrath, and her husband Anthony Mathias Candido, and two grandchildren, Nico Chandler Candido and Harry Edward Candido. Born November 29, 1930 in Berkeley, California to Robert Wardlaw MacGrath and Claire Friedmann, he grew up in South Orange, New Jersey. He was a graduate of Lehigh University and received his Masters Degree from New Jersey Institute of Technology. His career in facilities engineering and construction management included positions with American Airlines, Marriott Corporation, Fordham University, Pan American World Airways, and Pace University. He was a lover of travel, boating, cooking, and classical music, a longtime volunteer helping New York City's needy people, and enjoyed many summers with family and friends at Point O' Woods, NY. A memorial service will be held at the Brick Presbyterian Church Chapel on Friday, June 6, 2014 at 2:00pm. In lieu of flowers, donations may be made to Carnegie Hill Neighbors or to a charity of your choice.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "MACGRATH, EDWARD WARDLAW"}], "pub_date": "2014-06-01T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9B05E6DB1E3AF932A35755C0A9629D8B63"}