{"_id": "53c0516838f0d871b1c31eec", "print_page": "19", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "LETHBRIDGE--John Dodd. John Dodd \"Jack\" Lethbridge, passed away on June 26, 2014 at his home in Wilton, CT. He was 86 years old. The son of George M. Lethbridge and Gertrude Dodd, Jack was raised in Upper Montclair, NJ. He graduated from The Hill ...", "document_type": "article", "subsection_name": null, "word_count": "195", "headline": {"main": "Paid Notice: Deaths  LETHBRIDGE, JOHN DODD"}, "lead_paragraph": "LETHBRIDGE--John Dodd. John Dodd \"Jack\" Lethbridge, passed away on June 26, 2014 at his home in Wilton, CT. He was 86 years old. The son of George M. Lethbridge and Gertrude Dodd, Jack was raised in Upper Montclair, NJ. He graduated from The Hill School in Pottstown, PA and Washington and Lee University in Lexington, VA. He served in the US Marine Corps during the Korean conflict, achieving the rank of Captain. Jack spent most of his professional career at the National Distillers and Chemical Corporation where he retired as Vice President and General Manager of the National Distillers division. Jack was predeceased by his wife of 43 years, Betsy Emmaline Lethbridge. He is survived by his daughter Leah Ovington Lethbridge, his son John D. Lethbridge, Jr. and John's wife Karen Boutelle Lethbridge, his grandson John Dodd Lethbridge, III and his granddaughter Caroline Renee Lethbridge. There will be a Memorial Service on Wednesday, July 2, 2014 at 11am at the Wilton Congregational Church, 70 Ridgefield Rd., Wilton, CT. Interment will follow at Hillside Cemetery, 165 Ridgefield Rd., Wilton, CT. Memorial contributions may be made to the Wilton Library Association or the Wilton Volunteer Ambulance Corps.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "LETHBRIDGE, JOHN DODD"}], "pub_date": "2014-07-01T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9901E1DE163AF932A35754C0A9629D8B63"}