{"_id": "52f84fd938f0d81bf5cabc64", "print_page": "21", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "KATZ-DOFT--Rebecca Madeline, 35, of Atlanta, GA died on January 30, 2014, after a long battle with a debilitating illness. She passed away peacefully in her home surrounded by the people who loved her most. It is how she would have wanted it. Rebe...", "document_type": "article", "subsection_name": null, "word_count": "242", "headline": {"main": "Paid Notice: Deaths  KATZ, DOFT, REBECCA MADELINE"}, "lead_paragraph": "KATZ-DOFT--Rebecca Madeline, 35, of Atlanta, GA died on January 30, 2014, after a long battle with a debilitating illness. She passed away peacefully in her home surrounded by the people who loved her most. It is how she would have wanted it. Rebecca was born in Port Washington, NY on February 6, 1978 in the middle of a blizzard that shut down roads, and died during a snow and ice storm that shut down Atlanta. In between, she received her B.A. from Emory University and attended graduate school at the Rollins School for Public Health at Emory, before being forced to take leave for medical reasons. She was a staunch advocate for disability services and for providing equal access and opportunities to everyone - regardless of their disability. Over the course of her long illness, she touched many lives with the spirit and enthusiasm she brought to everyday and everyone she met. Rebecca is survived by her parents, Alexander Katz and Ellen Doft; brother, David Katz-Doft; sister-in-law, Emily Chamberlin; niece, Sophia Katz; grandparents, Elliot and Frances Doft; and her cats: Sam, Ike and Mamie. The family gives a special thanks to the men and women who helped care for Rebecca during her final months, and helped her have the peace and dignity she deserved. In lieu of flowers, memorial donations may be made to Weinstein Hospice, 3150 Howell Mill Road NW, Atlanta, GA 30327, www.weinsteinhospice.org or the Hewlett Chapter of Hadassah: www.hadassah.org", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "KATZ, DOFT, REBECCA MADELINE"}], "pub_date": "2014-02-02T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9B01EED6173AF931A35751C0A9629D8B63"}