{"_id": "53e8329538f0d84035b58209", "print_page": "22", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "HEATH--Clifford J.,Jr. Clifford John Heath, Jr., 88, of Basking Ridge, NJ, passed away peacefully on July 29th, 2014. Cliff was a loving husband, father and grandfather and a dedicated businessman known for his integrity and diplomacy. Cliff was b...", "document_type": "article", "subsection_name": null, "word_count": "320", "headline": {"main": "Paid Notice: Deaths  HEATH, CLIFFORD J."}, "lead_paragraph": "HEATH--Clifford J.,Jr. Clifford John Heath, Jr., 88, of Basking Ridge, NJ, passed away peacefully on July 29th, 2014. Cliff was a loving husband, father and grandfather and a dedicated businessman known for his integrity and diplomacy. Cliff was born in Englewood, NJ on October 4th, 1925 to Clifford J. Heath, Sr. and Beatrice Heath. He graduated from Teaneck High School in 1943 and enlisted in the US Army, serving in WWII in Europe. After the war he returned and attended Lawrenceville Prep, Princeton, and Columbia Universities, majoring in Government and Political Science. His business career included home building in Bergen/Mercer counties in the early 1950's, and President of Precipitation Associates of America from 1958-1992, an air pollution control company serving the Asphalt paving industry. From 1981 to 1992 Cliff served as President of the New Jersey Asphalt Paving Association, Executive Vice President of SWK Paving Engineering, Inc. from 1993-1996, then Executive Vice President of the New Jersey Alliance for Action from 1996-2012. Cliff was also a member of American Society of Highway Engineers, American Society of Testing and Materials, American Association of Paving Technology, the Transportation Research Board, and New Jersey Society of Municipal Engineers. He also served on the board of the New Jersey Society of Asphalt Technologists. Cliff was a patriot and like many members of the greatest generation, he took his obligations as a citizen seriously. He was keenly interested in public policy and enjoyed wide ranging debates on the issues of the day. Clifford is survived by his beloved wife of 39 years, Susan Heath, six children, Stuart Heath of Croton-on-Hudson, NY, Gary Glaser of Fairfield, CT, Steven Heath of Williston, ND, Deborah (Glaser) Henry of Fairfield, CT, Daniel Glaser of New York City, and Matthew Glaser of Wynnewood, PA, and 13 grandchildren, all of whom adored and loved him very much. He is predeceased by his first wife, Barbara (Mannhardt) Heath. Burial will be private.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "HEATH, CLIFFORD J."}], "pub_date": "2014-08-03T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9B0CE2D7173AF930A3575BC0A9629D8B63"}