{"_id": "549fd4a738f0d824d7b8e395", "print_page": null, "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "FRIEDBERG--Florence, 90, died suddenly after a period of declining health, on December 26, 2014 at St. Francis Hospital in Roslyn, NY. She is survived by her loving husband of 72 years, Barry Friedberg, her devoted children Diane and Marc Houslang...", "document_type": "article", "subsection_name": null, "word_count": "230", "headline": {"main": "Paid Notice: Deaths  FRIEDBERG, FLORENCE "}, "lead_paragraph": "<!-- FLORENCE  FRIEDBERG -->FRIEDBERG--Florence, 90, died suddenly after a period of declining health, on December 26, 2014 at St. Francis Hospital in Roslyn, NY. She is survived by her loving husband of 72 years, Barry Friedberg, her devoted children Diane and Marc Houslanger and Richard Friedberg and Courtenay Dodge; her grandchildren Michelle Houslanger, Joseph Houslanger, Sarah and Max Krohn, Hannah and David Orowitz; a great-grandchild Genevieve Krohn, and her sister Beatrice Segal. Florence was born in New York City on May 4, 1924 to Betty and Samuel Schick and graduated from Theodore Roosevelt High School in 1942. She was a devoted mother and wife and also enjoyed painting and volunteering at various charities. Along with her husband, she was engaged in a variety of philanthropic projects both in Nassau County, NY and Boca Raton, FL. She knew love was her highest priority. She and her husband were also very active in Temple B'nai Israel in Elmont, NY. The funeral service, under the direction of Gutterman's, will be held on Monday, December 29th at Temple B'nai Israel, 471 Elmont Road, Elmont, NY with services conducted by Rabbi Samuel Kehati. Burial will follow at Beth David Cemetery, Elmont, NY. In lieu of flowers, donations may be sent to the Barry and Florence Friedberg JCC in Oceanside, NY, Temple B'nai Israel of Elmont, or a charity of the donor's choice. May her memory be a blessing.<br><br>\n ", "slideshow_credits": null, "keywords": [], "pub_date": "2014-12-28T01:02:49Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://www.legacy.com/Link.asp?I=LS000173630696"}