{"_id": "5436026238f0d8435503818a", "print_page": "20", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "DELAPINE--Maryellen \"Mel,\" 64, of Estero, FL passed away on September 29, 2014. She is survived by her beloved husband, Tom; her daughter, Denise (George Leibel) and her son, Tommy (Angela). Mel was also the devoted and loving grandmother to Ali, ...", "document_type": "article", "subsection_name": null, "word_count": "260", "headline": {"main": "Paid Notice: Deaths  DELAPINE, MARYELLEN \"MEL,\" 64"}, "lead_paragraph": "DELAPINE--Maryellen \"Mel,\" 64, of Estero, FL passed away on September 29, 2014. She is survived by her beloved husband, Tom; her daughter, Denise (George Leibel) and her son, Tommy (Angela). Mel was also the devoted and loving grandmother to Ali, Brooklin, Taylor and Thomas Delapine and Melissa Michalak. After being diagnosed with Breast Cancer in 1997 Mel became a fierce and tireless advocate for women's health, active on the Community Outreach Board of the Linda Creed Breast Cancer Foundation, Advisory Board of the Breast Cancer Center of Excellence at the University of Pennsylvania, Community Ambassador for the American Cancer Society, Field Coordinator of the National Breast Cancer Coalition, and a member of the Committee on Education of the Florida Breast Cancer Coalition. In 2010, she became a Lung Cancer Advocate for the Alliance for Clinical Trials in Oncology. Mel was also a grant reviewer for the Department of Defense Breast Cancer Research Program, Komen for the Cure, NYS Board of Health, State of California Breast Cancer Research Program, the LiveStrong Foundation, Cochrane Collaboration, American Cancer Society, Department of Defense Lung Cancer Research Program, and the Cancer Prevention Research Institute of Texas. Her infectious personality, devotion, selflessness and sense of humor will be sorely missed by everyone in her family as well all of her volunteer colleagues throughout the country. There will be a private family service. In lieu of flowers, the family requests that donations be made to the Linda Creed Breast Cancer Foundation, P.O. Box 40607 Philadelphia, PA 19107 (http://www.lindacreed.org). Please visit www.fullermetz.com to leave the family a condolence.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "DELAPINE, MARYELLEN \"MEL,\" 64"}], "pub_date": "2014-10-01T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9504E6D6123AF932A35753C1A9629D8B63"}