{"_id": "531d2be038f0d85d201f7772", "print_page": "24", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "GREENMAN--Charles. Beloved husband, father, friend, attorney and advisor dies at 66. Charles Preston Greenman, a commercial litigator at the law firm of Troutman Sanders LLP, where he was a partner and defended numerous class actions relating to a...", "document_type": "article", "subsection_name": null, "word_count": "409", "headline": {"main": "Paid Notice: Deaths  GREENMAN, CHARLES"}, "lead_paragraph": "GREENMAN--Charles. Beloved husband, father, friend, attorney and advisor dies at 66. Charles Preston Greenman, a commercial litigator at the law firm of Troutman Sanders LLP, where he was a partner and defended numerous class actions relating to a wide variety of consumer and securities issues, died on Saturday, February 22, 2014, at Bellevue Hospital in Manhattan. He was respected both in and out of the courtroom as a force to be reckoned with. He served as Assistant Commissioner of the Department of Consumer Affairs for the City of New York and Consumer Advocate for the City--charting new ground for aggressively protecting consumers' rights. Much beloved husband of Jane, father of Margot, Jaclyn and Danielle, proud grandfather of Seymour (Simi), father in-law of Caio and son-in-law of Isabelle, as well as adored brother, friend, uncle, and godfather, Charles was larger than life. Charles was a graduate of Albion College in Michigan where he played college football, Boston University, where he earned a master's degree in history and New York University School of Law, from which he graduated with honors. He served as Chairman of the Robinson-Patman Act Subcommittee of the New York State Bar Association and Chairman of the Committee on Consumer Affairs of the New York County Lawyers' Association. In addition, he taught Consumer Law at NYU School of Law for more than a dozen years and wrote numerous articles on consumer law issues for the New York Law Journal and similar publications. His outsized physique, spirit and uncanny intelligence made people cling to him, looking for protection and guidance in a perilous and sometimes uncontrollable world, a responsibility naturally bestowed upon him that he embraced and enjoyed. Charles loved to travel, play tennis, bicycle, and to be doted upon by his adoring wife and daughters, who will miss him more than he could have ever imagined. We are better human beings today for knowing Charles and being part of his life. He made his home a welcome haven to all comers--friends, family and all their friends and children--all of whom came to him to seek advice and companionship. His giant personality was contagious and inspiring. He made his mark on the world and leaves a gap that can never be filled. Funeral services will be held on Monday, February 24, 2014 at 11:45am at Riverside Chapel in New York City, and the family will be receiving guests at home from Monday early evening until Friday, February 28, 2014.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "GREENMAN, CHARLES"}], "pub_date": "2014-03-02T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9406E5D9153AF931A35750C0A9629D8B63"}