{"_id": "52d3658538f0d825af3156c6", "print_page": "21", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "BLANK--Karen J.,of Manhattan, NY, passed away from complications related to cancer on December 31, 2013. Loving wife of Jim Milligan (deceased, January 2005), devoted mother of Ned Milligan, and treasured colleague, mentor, and friend to many. Kar...", "document_type": "article", "subsection_name": null, "word_count": "221", "headline": {"main": "Paid Notice: Deaths  BLANK, KAREN J."}, "lead_paragraph": "BLANK--Karen J.,of Manhattan, NY, passed away from complications related to cancer on December 31, 2013. Loving wife of Jim Milligan (deceased, January 2005), devoted mother of Ned Milligan, and treasured colleague, mentor, and friend to many. Karen served as Dean of Studies at Barnard College from 1993 through 2012, spending the previous decade as Associate Dean for Student Affairs at Columbia College. After graduating from the University of California-Berkeley, Karen left Albany, CA, where she was raised, to search out work in the field of higher education. This pursuit allowed her to experience and enhance student life at several colleges, ultimately bringing her to the Columbia University community of which she was proud to be a member for thirty years. In illness, Karen was cared for by her dedicated team of nurses, together with loyal friends and family. She drew love, strength and support from Ned, his wife Jamie, and the Cahill family (Barbara, Barry, Kristen, and Greg)-- relatives of Jim's who cared for Karen as one of their own. She is survived by them all, as well as her brother, Bob. Karen was always grateful for her life and to those who made it better. She will be celebrated in memoriam with a service on Thursday, January 9, 11am at West End Collegiate Church, 245 West 77th Street, New York.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "BLANK, KAREN J."}], "pub_date": "2014-01-05T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9A0CE6DD163AF936A35752C0A9629D8B63"}