{"_id": "5486742c38f0d8164e21e101", "print_page": "08", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "STOECKLEIN--David R. 1949-2014. Legendary photographer David R. Stoecklein left his mark on our world in more ways than one. The son of Bernard and Dorothy and brother of Buzzy, Julie, Walter and Debbie Stoecklein, he was born in Pittsburgh, Penns...", "document_type": "article", "subsection_name": null, "word_count": "403", "headline": {"main": "Paid Notice: Deaths  STOECKLEIN, DAVID R"}, "lead_paragraph": "STOECKLEIN--David R. 1949-2014. Legendary photographer David R. Stoecklein left his mark on our world in more ways than one. The son of Bernard and Dorothy and brother of Buzzy, Julie, Walter and Debbie Stoecklein, he was born in Pittsburgh, Pennsylvania in 1949. During his early twenties he headed west to pursue his passion for photography. David met Mary Jagger in 1976 and after moving to Sun Valley, Idaho, they married and were blessed with three boys-- Drew, Taylor and Colby. Everyone who knew David also understood that he was completely in love and devoted as a husband, a father and friend to all. David's images dominated the ski and outdoor industry, but his contribution to advertising made him one of the most sought after photographers in the business. He worked with Chevrolet and Jeep to Marlboro and Stetson, Canon USA and Epson, Coca Cola and Bayer to name a few. His passion was in documenting the cowboy way of life and the men and women who knew a thing or two about hard work and making an honest living. David lived by the code of the West. In fact he provided the photographs and publishing for the book Cowboy Ethics. His word was worth gold, and his handshake meant everything. He finished what he started, spoke his peace, but always listened first. He worked hard, played hard, and always made a stranger feel welcome. He was both tough and tender, and his life has inspired countless others. The iconic American Western photographer was much loved and admired for his gregarious character and passion for life. His photographs will forever be a tribute to his talents and his spirit will live on in all those whose lives he graced. He remains legendary. In his honor, Mary and her three sons have established the David R. Stoecklein Memorial and Educational Foundation. It is a charitable organization designed to provide help to causes David cared so much for--such as providing scholarships to aspiring photography students and to helping cowboys and cowgirls in need. The Stoecklein family would like to continue David's legacy of education and generosity for generations to come. Memorial donations in memory of David may be made to the David R. Stoecklein Memorial and Educational Foundation in care of Attorney Brian Barsotti, P.O. Box 370, Ketchum, ID 83340. A celebration of Davids life is being planned for the spring of 2015. www.stoeckleinphoto graphy.com 1/3", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "STOECKLEIN, DAVID R"}], "pub_date": "2014-12-01T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9D05E1DC1E3AF932A35751C1A9629D8B63"}