{"_id": "52d3659438f0d825af3156d4", "print_page": "21", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "FRIEDMAN--Jeffrey Arnold, died on December 30th after losing his battle with brain cancer, a battle he fought with admirable courage and strength. He was a true warrior. He was only 51 but lived a full life by giving unconditional support and love...", "document_type": "article", "subsection_name": null, "word_count": "200", "headline": {"main": "Paid Notice: Deaths  FRIEDMAN, JEFFREY ARNOLD"}, "lead_paragraph": "FRIEDMAN--Jeffrey Arnold, died on December 30th after losing his battle with brain cancer, a battle he fought with admirable courage and strength. He was a true warrior. He was only 51 but lived a full life by giving unconditional support and love to his family and friends. His love for his family was all encompassing, always protecting and providing. Passionate in all aspects of his life, he was a true and loyal friend. His commitment to his work was unshakeable to a fault until the end. Possessing deep convictions, he was steadfast when following his spiritual journey. He was a man of few words, but when said, they were pointed, real and true. He is survived by his wife, Adriana Friedman; daughter, Arielle Julia Friedman; sister, Jennifer Braunstein; brother-in-law, Rich Braunstein; neice, Jessica; nephew, Max; father, Arnold Friedman; and mother, Roz Guerriero. His memorial service will be held at Frank E. Campbell on Tuesday, January 7th, 2014 at 6:00pm. In lieu of flowers, donations should be made to Voices Against Brain Cancer to \"Team Jeffrey.\" For those of us who had the honor and privilege of knowing him, his love will continue to live with us each and every day.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "FRIEDMAN, JEFFREY ARNOLD"}], "pub_date": "2014-01-05T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9E06E4DD163AF936A35752C0A9629D8B63"}