{"_id": "5461de2638f0d80b742a021c", "print_page": null, "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "FOSTER--Israel Howard. We mourn the death of our husband and father, Israel Howard Foster, on November 2, shortly after his 91st birthday. Hal was the center of our universe as we were the constellation of his. Hal's sense of adventure and duty le...", "document_type": "article", "subsection_name": null, "word_count": "240", "headline": {"main": "Paid Notice: Deaths  FOSTER, ISRAEL "}, "lead_paragraph": "<!-- ISRAEL FOSTER -->FOSTER--Israel Howard.<br/><br/> We mourn the death of our husband and father, Israel Howard Foster, on November 2, shortly after his 91st birthday. Hal was the center of our universe as we were the constellation of his. Hal's sense of adventure and duty led him to many ports of call as a Pharmacist's Mate First Class in the Navy during WWII. He afterward owned and operated Foster's Pharmacy in Bedford Stuyvesant, where he was a fixture and beloved member of that community for over thirty years. Hal was a handsome man with beautiful, empathetic eyes and an uncomplicated joy in his life that endeared him to all who fell within the orbit of his gaze. He could do anything and do it well and we depended upon his quiet competence for the safety of our world. Hal's life was defined by his love for his family: Essie, his wife of almost 64 years, his five children Michael, Stacy, Tamar, Rafe, and Jody, and his eight grandchildren. This happiness was immutably altered in 2003 with the untimely death of his youngest son, Rafe, and again in 2012 with the death of his eldest son, Michael. This assault on his spirit took its toll on his already declining health and Hal spent the last four and a half years lovingly tended in the home of his daughter Tamar. Our dearest Hal, we love you so much, your spirit will be with us always.<br><br>\n ", "slideshow_credits": null, "keywords": [], "pub_date": "2014-11-10T19:14:28Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://www.legacy.com/Link.asp?I=LS000173120623"}