{"_id": "53c6e49838f0d858f3e37c33", "print_page": "23", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "AMERMAN--Patricia. April 30, 2014, New York, NY. Patricia Amerman, beloved friend and colleague. Together with her friends and family, Rubenstein mourns the loss of Pat Amerman, a dedicated and beloved employee of the agency for 17 years. Pat was ...", "document_type": "article", "subsection_name": null, "word_count": "241", "headline": {"main": "Paid Notice: Deaths  AMERMAN, PATRICIA"}, "lead_paragraph": "AMERMAN--Patricia. April 30, 2014, New York, NY. Patricia Amerman, beloved friend and colleague. Together with her friends and family, Rubenstein mourns the loss of Pat Amerman, a dedicated and beloved employee of the agency for 17 years. Pat was a warm, joyful, and positive person who always had a smile on her face. A skilled publicist, she won the respect and friendship of clients, colleagues and reporters alike. Whether she was overseeing publicity for clients at the New Year's Eve celebrations in Times Square, garnering wide coverage for Marble Collegiate Church in response to its \"yellow ribbon\" campaign honoring U.S. troops in Iraq, or helping to publicize the fundraising campaign for the renovation of St. Patrick's Cathedral, Pat was a master public relations strategist the utmost professional who gave her all to making every project a success. Even through her long battle with cancer, Pat insisted on working. She truly loved what she did. Pat had a wonderful network of friends and family that meant the world to her. She was dedicated to her parents and extremely proud of both her Irish and Greek heritages. Pat also was involved with community affairs in her Queens, NY neighborhood. The wake will be on Sunday, May 4, from 3:00 to 8:00pm at O'Shea-Hoey Funeral Home in Astoria. Pat relished life and made the most of her time. We will greatly miss our dear colleague and friend. Howard J. Rubenstein, Founder Steven Rubenstein, President", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "AMERMAN, PATRICIA"}], "pub_date": "2014-05-01T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9A04EFD8103AF932A35756C0A9629D8B63"}