{"_id": "5486747f38f0d8164e21e107", "print_page": "08", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "BODOFF--Lippman. May 28, 1930 -November 28, 2014. Retired corporate counsel for Lucent (formerly Western Electric Company) died of cardiac arrest following a long illness. Lippman was born in Brooklyn, eldest of three brothers. He graduated from C...", "document_type": "article", "subsection_name": null, "word_count": "271", "headline": {"main": "Paid Notice: Deaths  BODOFF, LIPPMAN"}, "lead_paragraph": "BODOFF--Lippman. May 28, 1930 -November 28, 2014. Retired corporate counsel for Lucent (formerly Western Electric Company) died of cardiac arrest following a long illness. Lippman was born in Brooklyn, eldest of three brothers. He graduated from City College of New York and Yale Law School. Most of his legal career was devoted to preventing the break-up of AT&T. Judge Harold Greene once suggested that Lippmans piece of the case was succeeding. When AT&T voluntarily broke itself up, Lippman went on to study history and literature in graduate school, which led to the publication of his book \"The Binding of Isaac Religious Murders and Kaballah...\" In addition he served as Assistant Editor of Judiasm Magazine, and lectured on Abraham and Isaac at Bergen Community College Institute for Learning in Retirement. For about 30 years Lippman was a serious amateur Cantor for two different congregations, and widely known as a teacher of his own cantorial style, which incorporated classical historical cantorial literarure with other classical music which illustrated the liturgy. On the lighter end, he directed productions of Gilbert and Sullivan, Fiddler on the Roof, and others for his congregation. Survivors include former wife Joan Krauss, brother Fred Bodoff, children Miriam Ben Yashar (Jerusalem), David Bodoff (Tel Aviv), grandchildren Ken and Adi Ben Yashar, Liam and Noam Bodoff, dearly loved nieces and nephews, and in particular his adored and adoring wife, Psychiatrist Meri Schachter Bodoff. Shiva will be at his home. Funeral Home: Robert Schoems Menorah Chapel, 150 W. State Street, Rt. 4, Paramus, NJ on Monday, December 1, 2014 at 11am. Cemetery: Beth David Cemetary, 300 Elmont Road, Elmont, NY 11003. 1/3", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "BODOFF, LIPPMAN"}], "pub_date": "2014-12-01T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9D07E3DC1E3AF932A35751C1A9629D8B63"}