{"_id": "5486748038f0d8164e21e108", "print_page": "08", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "DAVIES--Paul Lewis, Jr. was born in San Jose, California on July 21, 1930 to his parents, Faith Crummey Davies and Paul Lewis Davies. He attended public elementary, middle, and high schools in San Jose, and graduated from Stanford University in 19...", "document_type": "article", "subsection_name": null, "word_count": "395", "headline": {"main": "Paid Notice: Deaths  DAVIES, PAUL LEWIS"}, "lead_paragraph": "DAVIES--Paul Lewis, Jr. was born in San Jose, California on July 21, 1930 to his parents, Faith Crummey Davies and Paul Lewis Davies. He attended public elementary, middle, and high schools in San Jose, and graduated from Stanford University in 1952. He served in the U.S. Army and then returned to earn his JD from Harvard Law School in 1957. He married Barbara Bechtel in 1955; they had two children, Laura in 1957 and Lew in 1961. He was, above all, a family man, enjoying greatly his children and grandchildren. He also traveled widely, was an avid hunter, and was keenly interested and engaged in public policy and politics. Professionally, he joined Pillsbury Madison & Sutro in San Francisco after graduation from Harvard and quickly achieved prominence in the firms practice; he worked there until his retirement in 1989, serving as General Counsel of Chevron for over five years, during which he led the legal team for Chevrons 1984 acquisition of Gulf, at the time the largest corporate acquisition ever made. He was a valued advisor to many companies, serving as a director of FMC Corporation, Industrial Indemnity, Southern Pacific, and Sumitomo Bank, as well as several private companies. He was also deeply engaged in the community, serving on the boards of the Hoover Institution and the California Academy of Sciences, both of which he chaired; University of the Pacific, Samuel Merritt Hospital, Piedmont Community Church, and the Herbert Hoover Foundation. He was a member and past president of the Bohemian Club, The Pacific-Union Club, and Greenhead Land Company; and a member of many other social clubs. He passed away on November 19, 2014 and was predeceased by his wife of 46 years, Barbara Bechtel Davies, his parents, and his sister, Nancy Davies. He is survived by daughter, Laura Davies Mateo, and son, Paul Lewis Davies III (Pilar); seven grandchildren, Wesley Davies Mateo (Tory), Kenneth Peart Mateo, Robert Hanigan Davies, Gregory Wendell Mateo, Natalie Lynn Davies, Tyler Stephen Davies, and Meredith Mateo; his sister, Judith Davies Washburn, and brother-in-law, Stephen D. Bechtel (Betty), and their families; as well as many other relatives and friends. A memorial service will be held at Memorial Church at Stanford University at 2:00 p.m. on Thursday, December 11, 2014. In lieu of flowers, the family requests donations be made to the Hoover Institution or the California Academy of Sciences. 1/3", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "DAVIES, PAUL LEWIS"}], "pub_date": "2014-12-01T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9E06E3DC1E3AF932A35751C1A9629D8B63"}