{"_id": "53c6e49838f0d858f3e37c34", "print_page": "23", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "DANWITZ--Sister Winifred, Ursuline died peacefully at Andrus on Hudson on Tuesday, April 29, 2014 at 93. Her notable achievement was founding in 1961 the Mount St. Ursula Speech Center, for children with speech and hearing disabilities. Sr. Winifr...", "document_type": "article", "subsection_name": null, "word_count": "202", "headline": {"main": "Paid Notice: Deaths  DANWITZ, SISTER WINIFRED"}, "lead_paragraph": "DANWITZ--Sister Winifred, Ursuline died peacefully at Andrus on Hudson on Tuesday, April 29, 2014 at 93. Her notable achievement was founding in 1961 the Mount St. Ursula Speech Center, for children with speech and hearing disabilities. Sr. Winifred earned a MA from Brooklyn College and her Ph.D. from CUNY. She entered the Ursulines in 1945 and taught at the College of New Rochelle, the Academy of Mt. St. Ursula, Fordham University, Hunter College, and Iona College. She was a director of speech therapy, Archdiocese of NY, and professor of special education at CNR. In 1997 she founded Angela House, a transitional residence and place for homeless women and their children. Winifred served on several boards and received numerous awards for her teaching and service. She was predeceased by her parents, Eric and Winifred (O'Shea) Danwitz, and her sister Lillian; she is survived by several nieces and nephews. Wake will be held at the Ursuline Provincialate, 1338 North Avenue, New Rochelle, NY, on Friday, May 2, 3-5pm and 6-8pm. Mass of Christian Burial will be there at 10am on Saturday, May 3. Interment, Holy Sepulchre Cemetery. Gifts may be sent to the Ursuline Retirement Fund, 1338 North Avenue, New Rochelle, NY 10804. www.lloydmaxcy.com", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "DANWITZ, SISTER WINIFRED"}], "pub_date": "2014-05-01T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9B07EFD8103AF932A35756C0A9629D8B63"}