{"_id": "53e8329638f0d84035b5820a", "print_page": "22", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "HINES--Mary M.,Mary M. Hines of New York City and formerly Boston, MA passed away on July 27, 2014 at the age of 64. Mary fought a valiant battle against glioblastoma a fight that she never surrendered to in spirit or determination. A graduate of ...", "document_type": "article", "subsection_name": null, "word_count": "388", "headline": {"main": "Paid Notice: Deaths  HINES, MARY M."}, "lead_paragraph": "HINES--Mary M.,Mary M. Hines of New York City and formerly Boston, MA passed away on July 27, 2014 at the age of 64. Mary fought a valiant battle against glioblastoma a fight that she never surrendered to in spirit or determination. A graduate of Simmons College with a certificate from Harvard in Special Studies in Administration and Management, Mary spent 25 years working in the communications field in New England before relocating to Manhattan 15 years ago. Born in Cleveland, OH, Mary was raised in Englewood, NJ. She always lived her life to its fullest working, traveling and enjoying everything that the world had to offer. An ardent Democrat and a fierce bridge player, Mary was a dedicated daughter, sister, aunt, and loyal friend. She is predeceased by her parents, George A. and Mary M. Hines formerly of Englewood, NJ; she is survived by her adoring sisters, Frances A. Falk of West Milford, NJ, Ellen E. Hines of Fort Lee, NJ and brother, Paul K. Hines (Anna) of Stuart, FL. Her nieces and nephews, Kathleen and Kevin Falk, Emily Hyde (Jake), Julia, Grace, and Michael Hines should consider themselves blessed having had an Aunt as devoted as she was. Mary's loyal circle of friends span across the country and ocean you know who you are and how much you meant to Mary. We will each have to deal with the ache in our hearts as a result of her death but we will celebrate her life and remember with fondness how she touched each and every one of us and made us better people simply by the examples she set and by living her life with passion, honor and kindness. A memorial service will be held at a later date. Interment will take place at the Community Mausoleum at Sleepy Hollow Cemetery, Sleepy Hollow, NY. Mary's concern was always for those who were less fortunate. Donations can be made to The Loaves and Fishes Soup Kitchen and Pantry on behalf of Mary M. Hines at The Church of St. Paul the Apostle. Please make checks payable to The Church of St. Paul the Apostle (with a note included to benefit the Loaves and Fishes Program) and mailed to 405 W. 59th St. New York, NY 10019. We all wish you Godspeed, Mary. Services by Barrett Funeral Home Tenafly.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "HINES, MARY M."}], "pub_date": "2014-08-03T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9505E1D7173AF930A3575BC0A9629D8B63"}