{"_id": "5462dbf938f0d816585bff4f", "print_page": "16", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "APPEL--Beatrice H.,of New York City, on November 1, 2014, in her 105th year. Daughter of Samuel L. and Eva Hoffman, she had been married to Alfred for 69 years. She was a graduate of Adelphi Academy, attended Adelphi College, and was a graduate of...", "document_type": "article", "subsection_name": null, "word_count": "200", "headline": {"main": "Paid Notice: Deaths  APPEL, BEATRICE H."}, "lead_paragraph": "APPEL--Beatrice H.,of New York City, on November 1, 2014, in her 105th year. Daughter of Samuel L. and Eva Hoffman, she had been married to Alfred for 69 years. She was a graduate of Adelphi Academy, attended Adelphi College, and was a graduate of the American Academy of Dramatic Arts. For four years she was a volunteer guide at the United Nations in Lake Success, and spent twenty-four years as a docent at the Metropolitan Museum of Art, specializing in Egyptology, about which she was passionate. She also loved studying and teaching art history, and taught English to Russian emigres. She was an elegant, bright, and dynamic lady, who adored her family and is survived by her children, Prof. Nina S. Appel (late Alfred, Jr.), Betty and Paul Schaffer, and John S. Appel and Barbara Wolkowitz, her grandchildren Karen and Gene Oshman, Richard J. Appel, Dr. Mark A. Schaffer and David Goldman, and Catherine and Michael Rose, and her great-grandchildren Stephen and Katherine, Gabriel and Grace, and Andrew and Jenna. Also surviving is her devoted brother, Dr. Burton P. Hoffman, and his family. Services on Thursday, November 6, 2014, 10am, at Frank E. Campbell, 1076 Madison Ave. at 81st St.", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "APPEL, BEATRICE H."}], "pub_date": "2014-11-04T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9A01E4D6103AF937A35752C1A9629D8B63"}