{"_id": "52f84fcf38f0d81bf5cabc5f", "print_page": "21", "blog": [], "byline": null, "multimedia": [], "source": "The New York Times", "type_of_material": "Paid Death Notice", "news_desk": "Classified", "snippet": "HEYMAN--Anne. The Officers, Board, and staff of The American Jewish Joint Distribution Committee (JDC) mourn with profound sadness the untimely passing of Anne Heyman, beloved wife of Seth Merrin, and daughter-in-law of longtime JDC Board Member E...", "document_type": "article", "subsection_name": null, "word_count": "237", "headline": {"main": "Paid Notice: Deaths  HEYMAN, ANNE"}, "lead_paragraph": "HEYMAN--Anne. The Officers, Board, and staff of The American Jewish Joint Distribution Committee (JDC) mourn with profound sadness the untimely passing of Anne Heyman, beloved wife of Seth Merrin, and daughter-in-law of longtime JDC Board Member Edward Merrin. An accomplished lawyer and esteemed global philanthropist, Anne was deeply involved in a variety of Jewish and humanitarian causes in North America, Israel, Africa, and the former Soviet Union. As the Founder and Board Chair of the renowned Agahozo-Shalom Youth Village (ASYV) in Rwanda, Anne's boundless generosity, unbridled enthusiasm, and passionate dedication ensured a future for young Rwandans, many of them genocide orphans. We were proud to be her partner in ASYV's formative stages and to continue to support the village with Jewish Service Corps volunteers today. These young Jewish adults like all of us were awed by Anne's extraordinary leadership and the timeless example she set as a global citizen and unparalleled Jewish role model. We extend our heartfelt condolences to Ed and Vivian Merrin; Anne's beloved husband Seth and their children Jenna, Jonathan, and Jason; and to their entire family. May Anne's memory be for a blessing, and may all those whose lives were touched by Anne embrace the principles that guided her life and work: tikkun halev - repairing the heart - and tikkun olam - repairing the world. Penny Blumenstein President Dr. Irving A. Smokler Chairman of the Board Alan H. Gill Chief Executive Officer", "slideshow_credits": null, "keywords": [{"name": "persons", "value": "HEYMAN, ANNE"}], "pub_date": "2014-02-02T00:00:00Z", "section_name": "Paid Death Notices", "abstract": null, "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9D0CEFD6173AF931A35751C0A9629D8B63"}